{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[33mWARNING: The directory '/home/jovyan/.cache/pip' or its parent directory is not owned or is not writable by the current user. The cache has been disabled. Check the permissions and owner of that directory. If executing pip with sudo, you may want sudo's -H flag.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "!pip install ipython-cypher -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%reload_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###### **(OBS: IP FROM DOCKER)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>l.line_code</th>\n",
       "        <th>l.line_name</th>\n",
       "        <th>t.line_way</th>\n",
       "        <th>cnt</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>001</td>\n",
       "        <td>CIRCULAR CENTRO (HORARIO)</td>\n",
       "        <td>Horario</td>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>002</td>\n",
       "        <td>CIRCULAR CENTRO (ANTI-HORARIO)</td>\n",
       "        <td>Anti-Horario</td>\n",
       "        <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>010</td>\n",
       "        <td>INTERBAIRROS I (HORARIO)</td>\n",
       "        <td>Horario</td>\n",
       "        <td>46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>011</td>\n",
       "        <td>INTERBAIRROS I (ANTI-HORARIO)</td>\n",
       "        <td>Anti-Horario</td>\n",
       "        <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>011</td>\n",
       "        <td>INTERBAIRROS I (ANTI-HORARIO)</td>\n",
       "        <td>Anti-horario</td>\n",
       "        <td>53</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>020</td>\n",
       "        <td>INTERBAIRROS II (HORARIO)</td>\n",
       "        <td>Sentido Horario</td>\n",
       "        <td>105</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>020</td>\n",
       "        <td>INTERBAIRROS II (HORARIO)</td>\n",
       "        <td>Terminal Cabral</td>\n",
       "        <td>106</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>020</td>\n",
       "        <td>INTERBAIRROS II (HORARIO)</td>\n",
       "        <td>Terminal Campina do Siqueira</td>\n",
       "        <td>105</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>020</td>\n",
       "        <td>INTERBAIRROS II (HORARIO)</td>\n",
       "        <td>Terminal Cap?o Raso</td>\n",
       "        <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>020</td>\n",
       "        <td>INTERBAIRROS II (HORARIO)</td>\n",
       "        <td>Terminal Cap?o da Imbuia</td>\n",
       "        <td>106</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['001', 'CIRCULAR CENTRO (HORARIO)', 'Horario', 12],\n",
       " ['002', 'CIRCULAR CENTRO (ANTI-HORARIO)', 'Anti-Horario', 24],\n",
       " ['010', 'INTERBAIRROS I (HORARIO)', 'Horario', 46],\n",
       " ['011', 'INTERBAIRROS I (ANTI-HORARIO)', 'Anti-Horario', 51],\n",
       " ['011', 'INTERBAIRROS I (ANTI-HORARIO)', 'Anti-horario', 53],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Sentido Horario', 105],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cabral', 106],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Campina do Siqueira', 105],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cap?o Raso', 108],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cap?o da Imbuia', 106]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data \n",
    "MATCH (l:Line)-[:HAS_TRIP]->(t:Trip)-[:HAS_BUS_STOP]->(bs:BusStop) \n",
    "RETURN l.line_code,l.line_name, t.line_way, count(bs) as cnt order by l.line_code,t.line_way, cnt desc limit 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>bsbf.number</th>\n",
       "        <th>bsbf.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['140941', 'Av. Visconde de Guarapuava, 2646 - Centro']]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data \n",
    "MATCH (l:Line {line_code:'001'})-[:HAS_TRIP]->(t:Trip)-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH (l:Line {line_code:'001'})-[:HAS_TRIP]->(t:Trip)-[:ENDS_ON_POINT]->(bsf:BusStop)<-[:NEXT_STOP]-(bsbf:BusStop)\n",
    "with bsi, bsf\n",
    "MATCH (bsi)-[:NEXT_STOP*]->(bsbf)\n",
    "RETURN bsbf.number, bsbf.name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>bsbf.number</th>\n",
       "        <th>bsbf.name</th>\n",
       "        <th>h.value</th>\n",
       "        <th>ev.moving_status</th>\n",
       "        <th>count(ev)</th>\n",
       "        <th>avg(toFloat(ev.avg_velocity))</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>6</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>24.54</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>8</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>3</td>\n",
       "        <td>3.101666666666667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>8</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>3</td>\n",
       "        <td>25.86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>9</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>2</td>\n",
       "        <td>17.1175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>13</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>2</td>\n",
       "        <td>40.2225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>13</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>1</td>\n",
       "        <td>5.605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>14</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>4</td>\n",
       "        <td>8.3475</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>14</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>2</td>\n",
       "        <td>19.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>17</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>2</td>\n",
       "        <td>29.715000000000003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>18</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>2</td>\n",
       "        <td>31.015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>140941</td>\n",
       "        <td>Av. Visconde de Guarapuava, 2646 - Centro</td>\n",
       "        <td>18</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>1</td>\n",
       "        <td>3.25</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  6,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  24.54],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  8,\n",
       "  'STOPPED',\n",
       "  3,\n",
       "  3.101666666666667],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  8,\n",
       "  'MOVING',\n",
       "  3,\n",
       "  25.86],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  9,\n",
       "  'MOVING',\n",
       "  2,\n",
       "  17.1175],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  13,\n",
       "  'MOVING',\n",
       "  2,\n",
       "  40.2225],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  13,\n",
       "  'STOPPED',\n",
       "  1,\n",
       "  5.605],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  14,\n",
       "  'STOPPED',\n",
       "  4,\n",
       "  8.3475],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  14,\n",
       "  'MOVING',\n",
       "  2,\n",
       "  19.79],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  17,\n",
       "  'MOVING',\n",
       "  2,\n",
       "  29.715000000000003],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  18,\n",
       "  'MOVING',\n",
       "  2,\n",
       "  31.015],\n",
       " ['140941',\n",
       "  'Av. Visconde de Guarapuava, 2646 - Centro',\n",
       "  18,\n",
       "  'STOPPED',\n",
       "  1,\n",
       "  3.25]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data \n",
    "MATCH (l:Line {line_code:'001'})-[:HAS_TRIP]->(t:Trip)-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH (l:Line {line_code:'001'})-[:HAS_TRIP]->(t:Trip)-[:ENDS_ON_POINT]->(bsf:BusStop)<-[:NEXT_STOP]-(bsbf:BusStop)\n",
    "with bsi, bsf\n",
    "MATCH (bsi)-[:NEXT_STOP*]->(bsbf)<-[:IS_NEAR_BY]-(ev:Event)<-[:HAS_EVENT]-(h:Hour)\n",
    "RETURN bsbf.number, bsbf.name,h.value, ev.moving_status, count(ev), avg(toFloat(ev.avg_velocity)) order by bsbf.number, h.value"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### CALCULAR TEMPO MÉDIO DE DESLOCAMENTO ENTRE DOIS PONTOS DE UMA LINHA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "105 rows affected.\n"
     ]
    }
   ],
   "source": [
    "results = %cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data  \\\n",
    "MATCH(l:Line)-[:HAS_TRIP]-(t:Trip)-[:HAS_BUS_STOP]->(bss:BusStop {number:'110048'})-[:NEXT_STOP]->(bsf:BusStop {number:'110049'}) \\\n",
    "with l,t,bss, bsf  \\\n",
    "MATCH(ev:Event)-[:IS_NEAR_BY]->(bss)  \\\n",
    "MATCH(evf:Event )-[:IS_NEAR_BY]->(bsf)  \\\n",
    "MATCH(ev)-[:MOVED_TO*..6]->(evf)<-[:HAS_EVENT]-(t)  \\\n",
    "return distinct l.line_code,t.line_way,bss.number,bsf.number,ev.vehicle, ev.event_timestamp, evf.event_timestamp  order by ev.event_timestamp, evf.event_timestamp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = results.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(105, 7)"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "df['delta_time'] = pd.to_datetime(df['evf.event_timestamp']) - pd.to_datetime(df['ev.event_timestamp'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>l.line_code</th>\n",
       "      <th>t.line_way</th>\n",
       "      <th>bss.number</th>\n",
       "      <th>bsf.number</th>\n",
       "      <th>ev.vehicle</th>\n",
       "      <th>ev.event_timestamp</th>\n",
       "      <th>evf.event_timestamp</th>\n",
       "      <th>delta_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>110209</td>\n",
       "      <td>150631</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:12:12</td>\n",
       "      <td>2019-05-02 01:13:28</td>\n",
       "      <td>76.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>110209</td>\n",
       "      <td>150631</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:12:38</td>\n",
       "      <td>2019-05-02 01:13:28</td>\n",
       "      <td>50.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>150631</td>\n",
       "      <td>150632</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:13:28</td>\n",
       "      <td>2019-05-02 01:14:11</td>\n",
       "      <td>43.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150631</td>\n",
       "      <td>150631</td>\n",
       "      <td>JC852</td>\n",
       "      <td>2019-05-02 01:13:32</td>\n",
       "      <td>2019-05-02 01:13:43</td>\n",
       "      <td>11.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150631</td>\n",
       "      <td>150632</td>\n",
       "      <td>JC852</td>\n",
       "      <td>2019-05-02 01:13:32</td>\n",
       "      <td>2019-05-02 01:14:13</td>\n",
       "      <td>41.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150631</td>\n",
       "      <td>150632</td>\n",
       "      <td>JC852</td>\n",
       "      <td>2019-05-02 01:13:43</td>\n",
       "      <td>2019-05-02 01:14:13</td>\n",
       "      <td>30.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150632</td>\n",
       "      <td>150634</td>\n",
       "      <td>JC852</td>\n",
       "      <td>2019-05-02 01:14:13</td>\n",
       "      <td>2019-05-02 01:15:49</td>\n",
       "      <td>96.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>150634</td>\n",
       "      <td>180641</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:15:29</td>\n",
       "      <td>2019-05-02 01:16:12</td>\n",
       "      <td>43.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>150634</td>\n",
       "      <td>180641</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:15:45</td>\n",
       "      <td>2019-05-02 01:16:12</td>\n",
       "      <td>27.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>788</td>\n",
       "      <td>Vila Velha</td>\n",
       "      <td>180791</td>\n",
       "      <td>180789</td>\n",
       "      <td>JC856</td>\n",
       "      <td>2019-05-02 01:20:04</td>\n",
       "      <td>2019-05-02 01:20:42</td>\n",
       "      <td>38.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  month  day l.line_code  t.line_way bss.number bsf.number ev.vehicle  \\\n",
       "0  2019      5    2         788  Vila Velha     110209     150631      JC856   \n",
       "1  2019      5    2         788  Vila Velha     110209     150631      JC856   \n",
       "2  2019      5    2         788  Vila Velha     150631     150632      JC856   \n",
       "3  2019      5    2         789       Caiua     150631     150631      JC852   \n",
       "4  2019      5    2         789       Caiua     150631     150632      JC852   \n",
       "5  2019      5    2         789       Caiua     150631     150632      JC852   \n",
       "6  2019      5    2         789       Caiua     150632     150634      JC852   \n",
       "7  2019      5    2         788  Vila Velha     150634     180641      JC856   \n",
       "8  2019      5    2         788  Vila Velha     150634     180641      JC856   \n",
       "9  2019      5    2         788  Vila Velha     180791     180789      JC856   \n",
       "\n",
       "   ev.event_timestamp evf.event_timestamp  delta_time  \n",
       "0 2019-05-02 01:12:12 2019-05-02 01:13:28        76.0  \n",
       "1 2019-05-02 01:12:38 2019-05-02 01:13:28        50.0  \n",
       "2 2019-05-02 01:13:28 2019-05-02 01:14:11        43.0  \n",
       "3 2019-05-02 01:13:32 2019-05-02 01:13:43        11.0  \n",
       "4 2019-05-02 01:13:32 2019-05-02 01:14:13        41.0  \n",
       "5 2019-05-02 01:13:43 2019-05-02 01:14:13        30.0  \n",
       "6 2019-05-02 01:14:13 2019-05-02 01:15:49        96.0  \n",
       "7 2019-05-02 01:15:29 2019-05-02 01:16:12        43.0  \n",
       "8 2019-05-02 01:15:45 2019-05-02 01:16:12        27.0  \n",
       "9 2019-05-02 01:20:04 2019-05-02 01:20:42        38.0  "
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "342244 rows affected.\n"
     ]
    }
   ],
   "source": [
    "results = %cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data  \\\n",
    "MATCH(y:Year)-[:CONTAINS]->(m:Month)-[:CONTAINS]->(d:Day)-[:HAS_LINE]->(l:Line)-[:HAS_TRIP]->(t:Trip)-[:HAS_BUS_STOP]->(bss:BusStop)-[n:NEXT_STOP ]->(bsf:BusStop) \\\n",
    "with y,m,d,l,t,bss, bsf, n \\\n",
    "MATCH(ev:Event)-[:IS_NEAR_BY]->(bss)  \\\n",
    "MATCH(evf:Event )-[:IS_NEAR_BY]->(bsf)  \\\n",
    "MATCH(ev)-[:MOVED_TO*..6]->(evf)<-[:HAS_EVENT]-(t)  \\\n",
    "return distinct y.value as year,m.value as month,d.value as day, l.line_code,t.line_way,bss.number,bsf.number,n.distance, ev.vehicle, ev.event_timestamp, evf.event_timestamp  order by ev.event_timestamp, evf.event_timestamp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "df = results.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "df['ev.event_timestamp'] = pd.to_datetime(df['ev.event_timestamp'])\n",
    "df['evf.event_timestamp'] = pd.to_datetime(df['evf.event_timestamp'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "df['delta_time'] = df['evf.event_timestamp'] - df['ev.event_timestamp']\n",
    "df['delta_time'] = df['delta_time'].dt.total_seconds()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = df.sort_values(by=['l.line_code','t.line_way','ev.vehicle','ev.event_timestamp'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"times.csv\",index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>l.line_code</th>\n",
       "      <th>t.line_way</th>\n",
       "      <th>bss.number</th>\n",
       "      <th>bsf.number</th>\n",
       "      <th>delta_time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>101011</td>\n",
       "      <td>103506</td>\n",
       "      <td>196.996429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>102034</td>\n",
       "      <td>103505</td>\n",
       "      <td>120.816667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>103505</td>\n",
       "      <td>110016</td>\n",
       "      <td>131.547170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>103506</td>\n",
       "      <td>110048</td>\n",
       "      <td>265.335938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110016</td>\n",
       "      <td>110017</td>\n",
       "      <td>54.650000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9346</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>Z01</td>\n",
       "      <td>Unibrasil</td>\n",
       "      <td>130217</td>\n",
       "      <td>130340</td>\n",
       "      <td>35.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9347</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>Z01</td>\n",
       "      <td>Unibrasil</td>\n",
       "      <td>130219</td>\n",
       "      <td>130217</td>\n",
       "      <td>41.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9348</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>Z01</td>\n",
       "      <td>Unibrasil</td>\n",
       "      <td>130332</td>\n",
       "      <td>130219</td>\n",
       "      <td>137.400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9349</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>Z01</td>\n",
       "      <td>Unibrasil</td>\n",
       "      <td>130340</td>\n",
       "      <td>130341</td>\n",
       "      <td>25.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9350</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>Z01</td>\n",
       "      <td>Unibrasil</td>\n",
       "      <td>130342</td>\n",
       "      <td>130332</td>\n",
       "      <td>35.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>9351 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      year  month  day l.line_code t.line_way bss.number bsf.number  \\\n",
       "0     2019      5    2         001    Horario     101011     103506   \n",
       "1     2019      5    2         001    Horario     102034     103505   \n",
       "2     2019      5    2         001    Horario     103505     110016   \n",
       "3     2019      5    2         001    Horario     103506     110048   \n",
       "4     2019      5    2         001    Horario     110016     110017   \n",
       "...    ...    ...  ...         ...        ...        ...        ...   \n",
       "9346  2019      5    2         Z01  Unibrasil     130217     130340   \n",
       "9347  2019      5    2         Z01  Unibrasil     130219     130217   \n",
       "9348  2019      5    2         Z01  Unibrasil     130332     130219   \n",
       "9349  2019      5    2         Z01  Unibrasil     130340     130341   \n",
       "9350  2019      5    2         Z01  Unibrasil     130342     130332   \n",
       "\n",
       "      delta_time  \n",
       "0     196.996429  \n",
       "1     120.816667  \n",
       "2     131.547170  \n",
       "3     265.335938  \n",
       "4      54.650000  \n",
       "...          ...  \n",
       "9346   35.500000  \n",
       "9347   41.333333  \n",
       "9348  137.400000  \n",
       "9349   25.333333  \n",
       "9350   35.000000  \n",
       "\n",
       "[9351 rows x 8 columns]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.groupby(['year','month','day','l.line_code','t.line_way','bss.number','bsf.number'],as_index=False)['delta_time'].mean()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### ONIBUS DE DIFERENTES LINHAS QUE SE ENCONTRAM EM UM MESMO PONTO AO LONGO DO DIA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark.sql import SparkSession\n",
    "import pyspark.sql.functions as F\n",
    "import pyspark.sql.types as T\n",
    "from pyspark.sql import DataFrame\n",
    "from pyspark.sql.window import Window\n",
    "spark = SparkSession.builder.appName('abc').getOrCreate()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "312302 rows affected.\n"
     ]
    }
   ],
   "source": [
    "results = %cypher http://neo4j:h4ck3r@172.19.0.3:7474/db/data  \\\n",
    "MATCH (y:Year)-[:CONTAINS]->(m:Month)-[:CONTAINS]->(d:Day)-[:HAS_LINE]->(l:Line)-[:HAS_TRIP]->(t:Trip)-[:HAS_BUS_STOP]->(bss:BusStop) \\\n",
    "with y,m,d,l,t,bss \\\n",
    "MATCH (t)-[:HAS_EVENT]->(ev:Event)-[:IS_NEAR_BY]->(bss)  \\\n",
    "return  bss.number as busstop_number, l.line_code as line_code,t.line_way as line_way, ev.vehicle as vehicle, ev.event_timestamp as event_timestamp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = spark.createDataFrame(results.get_dataframe())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------+---------+--------------------+-------+-------------------+\n",
      "|busstop_number|line_code|            line_way|vehicle|    event_timestamp|\n",
      "+--------------+---------+--------------------+-------+-------------------+\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 10:46:10|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 12:47:08|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 16:14:11|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 14:49:52|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 09:47:16|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 17:10:32|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 17:37:29|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 07:15:39|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 11:45:48|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 07:49:11|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 13:18:57|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 12:16:36|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 20:39:31|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 21:33:54|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 23:24:05|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 07:48:53|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 22:29:32|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 22:03:45|\n",
      "|        190841|      150|Canal da Musica /...|  MN610|2019-05-02 21:33:33|\n",
      "|        190841|      150|Canal da Musica /...|  MN611|2019-05-02 18:16:11|\n",
      "+--------------+---------+--------------------+-------+-------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "df.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- busstop_number: string (nullable = true)\n",
      " |-- line_code: string (nullable = true)\n",
      " |-- line_way: string (nullable = true)\n",
      " |-- vehicle: string (nullable = true)\n",
      " |-- event_timestamp: string (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "df.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [],
   "source": [
    "minutes = lambda i: i * 60 \n",
    "\n",
    "window_spec = (\n",
    "    Window.partitionBy(df.busstop_number)\n",
    "        .orderBy(df.event_timestamp.cast(\"timestamp\").cast(\"long\")).rangeBetween(-minutes(10), 0)\n",
    ")\n",
    "\n",
    "\n",
    "events = (df.withColumn(\"count_lines\", F.size(F.collect_set('line_code').over(window_spec)))\n",
    "          .withColumn(\"count_vehicles\", F.size(F.collect_set('vehicle').over(window_spec)))\n",
    "          .withColumn(\"set_vehicles\", F.collect_set('vehicle').over(window_spec)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------+---------+--------------------+-------+-------------------+-----------+--------------+--------------------+\n",
      "|busstop_number|line_code|            line_way|vehicle|    event_timestamp|count_lines|count_vehicles|        set_vehicles|\n",
      "+--------------+---------+--------------------+-------+-------------------+-----------+--------------+--------------------+\n",
      "|        150751|      637|Terminal Pinheirinho|  GI008|2019-05-02 06:47:36|         10|            10|[GA169, HI013, HA...|\n",
      "|        150751|      637|Terminal Pinheirinho|  GI008|2019-05-02 06:47:15|         10|            10|[GA169, HI013, HA...|\n",
      "|        150751|      633|Terminal Pinheirinho|  GI010|2019-05-02 10:33:10|          9|             9|[HA190, GA169, GI...|\n",
      "|        150751|      655|Terminal Pinheirinho|  HI013|2019-05-02 10:35:39|          9|             9|[GA169, HI013, GI...|\n",
      "|        150331|      646|             Janaina|  HA609|2019-05-02 06:57:12|          9|             9|[GA169, HI013, HA...|\n",
      "|        150635|      701|   Praca Rui Barbosa|  JC312|2019-05-02 08:03:51|          7|             9|[JC012, HI854, JC...|\n",
      "|        150332|      633|Terminal Pinheirinho|  GI010|2019-05-02 10:35:42|          9|             9|[HA190, GA169, GI...|\n",
      "|        150635|      701|   Praca Rui Barbosa|  JC312|2019-05-02 08:03:48|          7|             9|[JC012, HI854, JC...|\n",
      "|        150751|      528|Terminal Pinheirinho|  EA009|2019-05-02 19:37:54|          9|             9|[GA169, GI011, HI...|\n",
      "|        150332|      617|Terminal Pinheirinho|  HA297|2019-05-02 08:24:28|          8|             9|[HA190, GI011, GI...|\n",
      "|        150751|      630|Terminal Pinheirinho|  HA021|2019-05-02 19:40:17|          9|             9|[GA169, GI011, HI...|\n",
      "|        150751|      630|Terminal Pinheirinho|  HA021|2019-05-02 19:40:24|          9|             9|[GA169, GI011, HI...|\n",
      "|        150751|      690|Terminal Pinheirinho|  HA197|2019-05-02 10:32:35|          9|             9|[HA190, GA169, GI...|\n",
      "|        150751|      633|Terminal Pinheirinho|  GI010|2019-05-02 10:32:53|          9|             9|[HA190, GA169, GI...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:49:46|          9|             9|[GA169, HI013, GI...|\n",
      "|        150332|      684|Terminal Pinheirinho|  HI604|2019-05-02 06:47:56|          9|             9|[GA169, HI013, HA...|\n",
      "|        150751|      684|Terminal Pinheirinho|  HI604|2019-05-02 06:46:22|          9|             9|[GA169, HI013, HA...|\n",
      "|        150751|      690|Terminal Pinheirinho|  HA197|2019-05-02 10:32:58|          9|             9|[HA190, GA169, GI...|\n",
      "|        110026|      777|   Praca Rui Barbosa|  JI004|2019-05-02 07:30:13|          8|             9|[HI858, JI003, JC...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:49:49|          9|             9|[GA169, HI013, GI...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:51:45|          9|             9|[GA169, HI013, GI...|\n",
      "|        150751|      633|Terminal Pinheirinho|  GI010|2019-05-02 10:33:15|          9|             9|[HA190, GA169, GI...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:50:00|          9|             9|[GA169, HI013, GI...|\n",
      "|        150332|      655|Terminal Pinheirinho|  HI013|2019-05-02 10:38:46|          9|             9|[GA169, HI013, GI...|\n",
      "|        110026|      663|   Praca Rui Barbosa|  EC008|2019-05-02 07:28:27|          9|             9|[HI858, JI003, JC...|\n",
      "|        110026|      703|   Praca Rui Barbosa|  JC307|2019-05-02 07:28:30|          9|             9|[HI858, JI003, JC...|\n",
      "|        150331|      646|             Janaina|  HA609|2019-05-02 06:57:35|          9|             9|[GA169, HI013, HA...|\n",
      "|        150635|      701|   Praca Rui Barbosa|  JC312|2019-05-02 08:04:04|          7|             9|[JC012, HI854, JC...|\n",
      "|        110024|      673|   Praca Rui Barbosa|  HI854|2019-05-02 09:17:49|          8|             8|[EC009, HI854, JC...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GI011|2019-05-02 10:28:59|          8|             8|[HA190, GA169, GI...|\n",
      "|        150635|      671|   Praca Rui Barbosa|  HI856|2019-05-02 08:03:03|          7|             8|[JC012, HI854, JC...|\n",
      "|        150751|      637|Terminal Pinheirinho|  GI008|2019-05-02 19:43:21|          8|             8|[GI011, HI606, GA...|\n",
      "|        150751|      528|Terminal Pinheirinho|  EA009|2019-05-02 10:30:20|          8|             8|[HA190, GA169, GI...|\n",
      "|        110022|      673|             Formosa|  HI854|2019-05-02 09:26:44|          8|             8|[EC009, GC018, HI...|\n",
      "|        110210|      762|   Praca Rui Barbosa|  JC861|2019-05-02 08:10:13|          6|             8|[JC012, JC317, HI...|\n",
      "|        150751|      690|Terminal Pinheirinho|  HA197|2019-05-02 14:31:10|          8|             8|[GA168, HA196, GI...|\n",
      "|        150751|      633|Terminal Pinheirinho|  GI010|2019-05-02 08:22:06|          8|             8|[HA190, GI011, GI...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GI011|2019-05-02 10:29:28|          8|             8|[HA190, GA169, GI...|\n",
      "|        150751|      690|Terminal Pinheirinho|  HA197|2019-05-02 14:31:07|          8|             8|[GA168, HA196, GI...|\n",
      "|        150331|      643|Umbara Via Campo ...|  GI003|2019-05-02 07:09:41|          8|             8|[GC001, HA190, EA...|\n",
      "|        110022|      703|      Terminal Caiua|  JC308|2019-05-02 14:45:31|          8|             8|[JC854, JC308, HI...|\n",
      "|        110022|      703|      Terminal Caiua|  JC308|2019-05-02 14:46:23|          8|             8|[JC854, JC308, HI...|\n",
      "|        150635|      671|   Praca Rui Barbosa|  HI856|2019-05-02 08:03:22|          7|             8|[JC012, HI854, JC...|\n",
      "|        150751|      636|Terminal Pinheirinho|  GA168|2019-05-02 12:20:29|          8|             8|[GA169, GA168, HA...|\n",
      "|        150751|      684|Terminal Pinheirinho|  HI606|2019-05-02 19:37:36|          8|             8|[GA169, GI011, HI...|\n",
      "|        150330|      633|Terminal Pinheirinho|  GI010|2019-05-02 10:33:44|          8|             8|[HA190, GA169, GI...|\n",
      "|        150751|      655|Terminal Pinheirinho|  HI013|2019-05-02 06:44:44|          8|             8|[GA169, HI013, HA...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GA168|2019-05-02 21:20:19|          8|             8|[GA168, GI010, HA...|\n",
      "|        150751|      528|Terminal Pinheirinho|  EA009|2019-05-02 10:30:13|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      655|Terminal Pinheirinho|  HA005|2019-05-02 15:03:57|          8|             8|[HA190, GA169, GI...|\n",
      "|        110026|      561|   Praca Rui Barbosa|  EC012|2019-05-02 11:32:59|          8|             8|[EC009, JC308, JC...|\n",
      "|        150331|      646|             Janaina|  HA193|2019-05-02 18:08:26|          8|             8|[HI003, HI013, HA...|\n",
      "|        150331|      646|             Janaina|  HA193|2019-05-02 07:16:34|          8|             8|[HA193, GI010, HA...|\n",
      "|        150331|      617|        Jd. Ludovica|  HA297|2019-05-02 07:20:04|          8|             8|[HA193, HA031, GA...|\n",
      "|        110022|      703|      Terminal Caiua|  JC314|2019-05-02 09:26:47|          8|             8|[EC009, GC018, HI...|\n",
      "|        110211|      674|   Praca Rui Barbosa|  LC018|2019-05-02 08:14:55|          7|             8|[JC317, HI854, LC...|\n",
      "|        110210|      671|   Praca Rui Barbosa|  HI856|2019-05-02 07:02:24|          7|             8|[JC012, JC302, HI...|\n",
      "|        110210|      776|   Praca Rui Barbosa|  JC006|2019-05-02 06:58:22|          8|             8|[JC012, HI854, LC...|\n",
      "|        150635|      671|   Praca Rui Barbosa|  HI856|2019-05-02 08:02:57|          7|             8|[JC012, HI854, JC...|\n",
      "|        150332|      655|Terminal Pinheirinho|  HI013|2019-05-02 06:46:46|          8|             8|[GA169, HI013, HA...|\n",
      "|        150751|      655|Terminal Pinheirinho|  HI013|2019-05-02 06:44:42|          8|             8|[GA169, HI013, HA...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GI011|2019-05-02 10:31:56|          8|             8|[HA190, GA169, GI...|\n",
      "|        150751|      637|Terminal Pinheirinho|  GI008|2019-05-02 19:43:02|          8|             8|[GI011, HI606, GA...|\n",
      "|        150332|      528|Terminal Pinheirinho|  EA009|2019-05-02 10:32:06|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      690|Terminal Pinheirinho|  HA197|2019-05-02 10:35:07|          8|             8|[HA190, GA169, GI...|\n",
      "|        150751|      617|Terminal Pinheirinho|  HA297|2019-05-02 08:22:46|          8|             8|[GI011, GI010, EA...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:52:06|          8|             8|[GA169, HI013, GI...|\n",
      "|        150330|      655|Terminal Pinheirinho|  HI013|2019-05-02 10:36:48|          8|             8|[GA169, HI013, GI...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GI011|2019-05-02 06:51:48|          8|             8|[GA169, HI013, GI...|\n",
      "|        150332|      690|Terminal Pinheirinho|  HA197|2019-05-02 14:34:21|          8|             8|[GA168, HA196, GI...|\n",
      "|        150332|      633|Terminal Pinheirinho|  GI010|2019-05-02 08:24:08|          8|             8|[HA190, GI011, GI...|\n",
      "|        110026|      561|   Praca Rui Barbosa|  EC012|2019-05-02 11:33:01|          8|             8|[EC009, JC308, JC...|\n",
      "|        150332|      617|Terminal Pinheirinho|  HA297|2019-05-02 08:24:49|          8|             8|[GI011, GI010, EA...|\n",
      "|        110024|      777|   Praca Rui Barbosa|  JI004|2019-05-02 07:28:37|          7|             8|[JI003, JC014, EC...|\n",
      "|        150331|      639|            Futurama|  GA156|2019-05-02 07:11:52|          8|             8|[GC001, HA190, GI...|\n",
      "|        150331|      528|  Terminal Boqueir?o|  EA009|2019-05-02 07:13:14|          8|             8|[HA190, GI010, HA...|\n",
      "|        150331|      650|          Santa Rita|  HA031|2019-05-02 07:14:28|          8|             8|[HA190, GI010, HA...|\n",
      "|        150331|      637|Terminal Sitio Ce...|  GI004|2019-05-02 07:18:36|          8|             8|[HA193, HA031, GA...|\n",
      "|        110211|      701|   Praca Rui Barbosa|  JI602|2019-05-02 08:15:19|          7|             8|[JC317, HI854, LC...|\n",
      "|        110022|      703|      Terminal Caiua|  JC314|2019-05-02 09:26:00|          8|             8|[EC009, GC018, HI...|\n",
      "|        110211|      701|   Praca Rui Barbosa|  JI602|2019-05-02 08:14:55|          7|             8|[JC317, HI854, LC...|\n",
      "|        110211|      674|   Praca Rui Barbosa|  LC018|2019-05-02 08:15:15|          7|             8|[JC317, HI854, LC...|\n",
      "|        110022|      701| Terminal Fazendinha|  JI603|2019-05-02 18:49:53|          7|             8|[EC004, JC312, GN...|\n",
      "|        110210|      671|   Praca Rui Barbosa|  HI856|2019-05-02 07:02:27|          7|             8|[JC012, JC302, HI...|\n",
      "|        110210|      776|   Praca Rui Barbosa|  JC006|2019-05-02 06:58:03|          8|             8|[JC012, HI854, LC...|\n",
      "|        110210|      701|   Praca Rui Barbosa|  JC312|2019-05-02 08:07:21|          5|             8|[JC012, JC317, HI...|\n",
      "|        110210|      701|   Praca Rui Barbosa|  JC312|2019-05-02 08:08:03|          5|             8|[JC012, JC317, HI...|\n",
      "|        150751|      643|Terminal Pinheiri...|  GI003|2019-05-02 15:04:15|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      638|Terminal Pinheirinho|  GA207|2019-05-02 06:44:34|          8|             8|[GA169, HA296, HA...|\n",
      "|        150332|      690|Terminal Pinheirinho|  HA197|2019-05-02 10:35:09|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      528|Terminal Pinheirinho|  GI017|2019-05-02 15:03:37|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GA168|2019-05-02 12:22:45|          8|             8|[GA169, GA168, HA...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GA168|2019-05-02 12:22:48|          8|             8|[GA169, GA168, HA...|\n",
      "|        150330|      636|Terminal Pinheirinho|  GI011|2019-05-02 10:29:50|          8|             8|[HA190, GA169, GI...|\n",
      "|        150332|      643|Terminal Pinheiri...|  GI003|2019-05-02 15:07:04|          8|             8|[HA190, GA169, GI...|\n",
      "|        110026|      703|   Praca Rui Barbosa|  JC307|2019-05-02 07:28:13|          8|             8|[HI858, JI003, JC...|\n",
      "|        150332|      636|Terminal Pinheirinho|  GA168|2019-05-02 21:20:07|          8|             8|[GA168, GI010, HA...|\n",
      "|        110024|      674|   Praca Rui Barbosa|  LC297|2019-05-02 09:17:49|          8|             8|[EC009, HI854, JC...|\n",
      "|        150331|      639|            Futurama|  GA156|2019-05-02 07:12:18|          8|             8|[GC001, HA190, GI...|\n",
      "|        150331|      643|  Umbara Via Calixto|  GA161|2019-05-02 06:56:01|          8|             8|[GA169, HI013, HA...|\n",
      "+--------------+---------+--------------------+-------+-------------------+-----------+--------------+--------------------+\n",
      "only showing top 100 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "events.orderBy(F.desc(\"count_vehicles\")).show(100)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
