{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install ipython-cypher -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "pd.set_option('max_colwidth', -1)\n",
    "pd.set_option('display.max_rows', 500)\n",
    "\n",
    "from pyspark.sql import SparkSession\n",
    "import pyspark.sql.functions as F\n",
    "import pyspark.sql.types as T\n",
    "from pyspark.sql import DataFrame\n",
    "from pyspark.sql.window import Window\n",
    "spark = SparkSession.builder.appName('abc').getOrCreate()\n",
    "\n",
    "from pyspark.sql.functions import col\n",
    "from pyspark.sql import SparkSession"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "%reload_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "env: NEO4J_URL=http://neo4j:h4ck3r@172.19.0.2:7474/db/data\n"
     ]
    }
   ],
   "source": [
    "%env NEO4J_URL=http://neo4j:h4ck3r@172.19.0.2:7474/db/data "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###### **(OBS: IP FROM DOCKER)**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **LINHAS E QUANTIDADES DE PARADAS PARA CADA SENTIDO DA LINHA**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>line_code</th>\n",
       "            <th>line_name</th>\n",
       "            <th>line_way</th>\n",
       "            <th>cnt</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>001</td>\n",
       "            <td>CIRCULAR CENTRO (HORARIO)</td>\n",
       "            <td>Horario</td>\n",
       "            <td>12</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>002</td>\n",
       "            <td>CIRCULAR CENTRO (ANTI-HORARIO)</td>\n",
       "            <td>Anti-Horario</td>\n",
       "            <td>24</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>010</td>\n",
       "            <td>INTERBAIRROS I (HORARIO)</td>\n",
       "            <td>Horario</td>\n",
       "            <td>46</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>011</td>\n",
       "            <td>INTERBAIRROS I (ANTI-HORARIO)</td>\n",
       "            <td>Anti-Horario</td>\n",
       "            <td>51</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>011</td>\n",
       "            <td>INTERBAIRROS I (ANTI-HORARIO)</td>\n",
       "            <td>Anti-horario</td>\n",
       "            <td>53</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>020</td>\n",
       "            <td>INTERBAIRROS II (HORARIO)</td>\n",
       "            <td>Sentido Horario</td>\n",
       "            <td>105</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>020</td>\n",
       "            <td>INTERBAIRROS II (HORARIO)</td>\n",
       "            <td>Terminal Cabral</td>\n",
       "            <td>106</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>020</td>\n",
       "            <td>INTERBAIRROS II (HORARIO)</td>\n",
       "            <td>Terminal Campina do Siqueira</td>\n",
       "            <td>105</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>020</td>\n",
       "            <td>INTERBAIRROS II (HORARIO)</td>\n",
       "            <td>Terminal Cap?o Raso</td>\n",
       "            <td>108</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>020</td>\n",
       "            <td>INTERBAIRROS II (HORARIO)</td>\n",
       "            <td>Terminal Cap?o da Imbuia</td>\n",
       "            <td>106</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['001', 'CIRCULAR CENTRO (HORARIO)', 'Horario', 12],\n",
       " ['002', 'CIRCULAR CENTRO (ANTI-HORARIO)', 'Anti-Horario', 24],\n",
       " ['010', 'INTERBAIRROS I (HORARIO)', 'Horario', 46],\n",
       " ['011', 'INTERBAIRROS I (ANTI-HORARIO)', 'Anti-Horario', 51],\n",
       " ['011', 'INTERBAIRROS I (ANTI-HORARIO)', 'Anti-horario', 53],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Sentido Horario', 105],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cabral', 106],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Campina do Siqueira', 105],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cap?o Raso', 108],\n",
       " ['020', 'INTERBAIRROS II (HORARIO)', 'Terminal Cap?o da Imbuia', 106]]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line)-[:HAS_TRIP]->(t:Trip)-[:HAS_BUS_STOP]->(bs:BusStop) \n",
    "RETURN l.line_code as line_code,l.line_name as line_name, t.line_way as line_way, count(bs) as cnt \n",
    "order by line_code, line_way, cnt desc limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **LINHAS QUE POSSUEM MAIS DE UM START POINT OU END POINT**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Start Points"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>cnt</th>\n",
       "            <th>line_code</th>\n",
       "            <th>line_name</th>\n",
       "            <th>line_way</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>550</td>\n",
       "            <td>LIGEIR?O PINHEIRINHO / C. GOMES</td>\n",
       "            <td>Praca Carlos Gomes</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>011</td>\n",
       "            <td>INTERBAIRROS I (ANTI-HORARIO)</td>\n",
       "            <td>Anti-horario</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>231</td>\n",
       "            <td>BANESTADO / CALIFORNIA</td>\n",
       "            <td>Terminal Santa Candida</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>789</td>\n",
       "            <td>MAD. CAIUA</td>\n",
       "            <td>Caiua</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>616</td>\n",
       "            <td>PORTAO / STA. BERNADETHE - L. VERDE</td>\n",
       "            <td>Terminal Port?o</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>656</td>\n",
       "            <td>KAMYR</td>\n",
       "            <td>Terminal Pinheirinho</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>938</td>\n",
       "            <td>JOSE CULPI / VENEZA</td>\n",
       "            <td>Terminal Santa Felicidade</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>928</td>\n",
       "            <td>PASSAUNA / JD.IPE</td>\n",
       "            <td>Terminal Santa Felicidade</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>516</td>\n",
       "            <td>C. BELEM / S. FILHO</td>\n",
       "            <td>Canal Belem</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>948</td>\n",
       "            <td>BUTIATUVINHA/ OURO VERDE</td>\n",
       "            <td>Terminal Santa Felicidade</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>462</td>\n",
       "            <td>PETROPOLIS</td>\n",
       "            <td>Praca Rui Barbosa</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>820</td>\n",
       "            <td>AUGUSTA/V. MARQUETO</td>\n",
       "            <td>Terminal Campo Comprido</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>010</td>\n",
       "            <td>INTERBAIRROS I (HORARIO)</td>\n",
       "            <td>Horario</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>211</td>\n",
       "            <td>COLINA VERDE</td>\n",
       "            <td>Colina Verde</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>690</td>\n",
       "            <td>V. JULIANA</td>\n",
       "            <td>Terminal Pinheirinho</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[2, '550', 'LIGEIR?O PINHEIRINHO / C. GOMES', 'Praca Carlos Gomes'],\n",
       " [2, '011', 'INTERBAIRROS I (ANTI-HORARIO)', 'Anti-horario'],\n",
       " [2, '231', 'BANESTADO / CALIFORNIA', 'Terminal Santa Candida'],\n",
       " [2, '789', 'MAD. CAIUA', 'Caiua'],\n",
       " [2, '616', 'PORTAO / STA. BERNADETHE - L. VERDE', 'Terminal Port?o'],\n",
       " [2, '656', 'KAMYR', 'Terminal Pinheirinho'],\n",
       " [2, '938', 'JOSE CULPI / VENEZA', 'Terminal Santa Felicidade'],\n",
       " [2, '928', 'PASSAUNA / JD.IPE', 'Terminal Santa Felicidade'],\n",
       " [2, '516', 'C. BELEM / S. FILHO', 'Canal Belem'],\n",
       " [2, '948', 'BUTIATUVINHA/ OURO VERDE', 'Terminal Santa Felicidade'],\n",
       " [2, '462', 'PETROPOLIS', 'Praca Rui Barbosa'],\n",
       " [2, '820', 'AUGUSTA/V. MARQUETO', 'Terminal Campo Comprido'],\n",
       " [2, '010', 'INTERBAIRROS I (HORARIO)', 'Horario'],\n",
       " [2, '211', 'COLINA VERDE', 'Colina Verde'],\n",
       " [2, '690', 'V. JULIANA', 'Terminal Pinheirinho']]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line)-[:HAS_TRIP]->(t:Trip)-[:STARTS_ON_POINT]->(bs:BusStop)  \n",
    "WITH l.line_code as line_code,l.line_name as line_name, t.line_way as line_way, count(bs) as cnt WHERE cnt > 1\n",
    "return *\n",
    "order by cnt desc "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* End Points"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>cnt</th>\n",
       "            <th>line_code</th>\n",
       "            <th>line_name</th>\n",
       "            <th>line_way</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>516</td>\n",
       "            <td>C. BELEM / S. FILHO</td>\n",
       "            <td>Canal Belem</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>516</td>\n",
       "            <td>C. BELEM / S. FILHO</td>\n",
       "            <td>Salgado Filho</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>211</td>\n",
       "            <td>COLINA VERDE</td>\n",
       "            <td>Terminal Cabral</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>211</td>\n",
       "            <td>COLINA VERDE</td>\n",
       "            <td>Terminal Cabral (Via Amancio Moro)</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>2</td>\n",
       "            <td>776</td>\n",
       "            <td>CARMELA DUTRA</td>\n",
       "            <td>Praca Rui Barbosa</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[[2, '516', 'C. BELEM / S. FILHO', 'Canal Belem'],\n",
       " [2, '516', 'C. BELEM / S. FILHO', 'Salgado Filho'],\n",
       " [2, '211', 'COLINA VERDE', 'Terminal Cabral'],\n",
       " [2, '211', 'COLINA VERDE', 'Terminal Cabral (Via Amancio Moro)'],\n",
       " [2, '776', 'CARMELA DUTRA', 'Praca Rui Barbosa']]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line)-[:HAS_TRIP]->(t:Trip)-[:ENDS_ON_POINT]->(bs:BusStop)  \n",
    "WITH l.line_code as line_code,l.line_name as line_name, t.line_way as line_way, count(bs) as cnt WHERE cnt > 1\n",
    "return *\n",
    "order by cnt desc "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **PARADAS PARA DA LINHA 666**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "29 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>bus_stop.number</th>\n",
       "            <th>bus_stop.name</th>\n",
       "            <th>bus_stop.latitude</th>\n",
       "            <th>bus_stop.longitude</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>102001</td>\n",
       "            <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "            <td>-25.43588731128</td>\n",
       "            <td>-49.274486810976</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110022</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 280-350 - Centro</td>\n",
       "            <td>-25.439756734365</td>\n",
       "            <td>-49.273240017786</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110023</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 712 - Reboucas</td>\n",
       "            <td>-25.444237601078</td>\n",
       "            <td>-49.27107815732</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150180</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 1316 - Reboucas</td>\n",
       "            <td>-25.448215787776</td>\n",
       "            <td>-49.269060523457</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150181</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 1700 - Reboucas</td>\n",
       "            <td>-25.451248049822</td>\n",
       "            <td>-49.267590672916</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150182</td>\n",
       "            <td>Rua 24 de Maio, 2006 - Reboucas</td>\n",
       "            <td>-25.45389637276</td>\n",
       "            <td>-49.266295165962</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150005</td>\n",
       "            <td>Av. Pres. Kennedy, 700 - Reboucas</td>\n",
       "            <td>-25.45518</td>\n",
       "            <td>-49.26739</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150007</td>\n",
       "            <td>Av. Pres. Kennedy, 1090 - Agua Verde</td>\n",
       "            <td>-25.45792</td>\n",
       "            <td>-49.27044</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150008</td>\n",
       "            <td>Av. Pres. Kennedy, 1472 - Agua Verde</td>\n",
       "            <td>-25.460568162875</td>\n",
       "            <td>-49.27336682209</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150656</td>\n",
       "            <td>Rua Minas Gerais, 170 - Guaira</td>\n",
       "            <td>-25.463050620489</td>\n",
       "            <td>-49.274737418837</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150659</td>\n",
       "            <td>Rua Minas Gerais, 322 - Guaira</td>\n",
       "            <td>-25.464842640389</td>\n",
       "            <td>-49.273853630967</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150661</td>\n",
       "            <td>Rua Minas Gerais, 698 - Guaira</td>\n",
       "            <td>-25.466962759195</td>\n",
       "            <td>-49.272961796469</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150662</td>\n",
       "            <td>Rua Minas Gerais, 927 - Guaira</td>\n",
       "            <td>-25.469383111858</td>\n",
       "            <td>-49.27181381101</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150664</td>\n",
       "            <td>Rua Alagoas, 746 - Guaira</td>\n",
       "            <td>-25.470183427863</td>\n",
       "            <td>-49.273341329044</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150816</td>\n",
       "            <td>Rua Alagoas, 1038 - Guaira</td>\n",
       "            <td>-25.471190777201</td>\n",
       "            <td>-49.275988669342</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150667</td>\n",
       "            <td>Rua Alagoas, 1182 - Guaira</td>\n",
       "            <td>-25.471839738172</td>\n",
       "            <td>-49.277623475737</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150034</td>\n",
       "            <td>Rua Alagoas, 1618 - Guaira</td>\n",
       "            <td>-25.473237135961</td>\n",
       "            <td>-49.281267256683</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150767</td>\n",
       "            <td>Rua Alagoas, 1910 - Guaira</td>\n",
       "            <td>-25.474567721691</td>\n",
       "            <td>-49.284758151716</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150768</td>\n",
       "            <td>Rua Alagoas, 2200 - Guaira</td>\n",
       "            <td>-25.475354685393</td>\n",
       "            <td>-49.286861003584</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150769</td>\n",
       "            <td>Rua Jose de Almeida Garrete, 22 - Port?o</td>\n",
       "            <td>-25.47724769283</td>\n",
       "            <td>-49.286776514</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150770</td>\n",
       "            <td>Rua Paulo Betes, 104 - Novo Mundo</td>\n",
       "            <td>-25.479221101938</td>\n",
       "            <td>-49.285906137175</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150110</td>\n",
       "            <td>Rua Ildefonso Stockler de Franca, 587 - Novo Mundo</td>\n",
       "            <td>-25.481324018204</td>\n",
       "            <td>-49.287937910503</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150115</td>\n",
       "            <td>Rua Jose Palu, 346 - Novo Mundo</td>\n",
       "            <td>-25.482753786554</td>\n",
       "            <td>-49.288572252935</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150772</td>\n",
       "            <td>Rua Jose Palu, 712 - Novo Mundo</td>\n",
       "            <td>-25.485097552922</td>\n",
       "            <td>-49.289134175724</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150643</td>\n",
       "            <td>Rua Isidoro Siedeliski, 79 - Novo Mundo</td>\n",
       "            <td>-25.486982987129</td>\n",
       "            <td>-49.289060414976</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150645</td>\n",
       "            <td>Rua Isidoro Siedeliski, 187 - Novo Mundo</td>\n",
       "            <td>-25.4881294126</td>\n",
       "            <td>-49.288113595194</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150647</td>\n",
       "            <td>Rua Isidoro Siedeliski, 267- Novo Mundo</td>\n",
       "            <td>-25.489787896832</td>\n",
       "            <td>-49.286775172895</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150650</td>\n",
       "            <td>Rua das Andorinhas, 512 - Novo Mundo</td>\n",
       "            <td>-25.491186090211</td>\n",
       "            <td>-49.284231097645</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150651</td>\n",
       "            <td>Rua das Perdizes, 16 - Novo Mundo</td>\n",
       "            <td>-25.492493694247</td>\n",
       "            <td>-49.281699020272</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  '-25.43588731128',\n",
       "  '-49.274486810976'],\n",
       " ['110022',\n",
       "  'Rua Vinte e Quatro de Maio, 280-350 - Centro',\n",
       "  '-25.439756734365',\n",
       "  '-49.273240017786'],\n",
       " ['110023',\n",
       "  'Rua Vinte e Quatro de Maio, 712 - Reboucas',\n",
       "  '-25.444237601078',\n",
       "  '-49.27107815732'],\n",
       " ['150180',\n",
       "  'Rua Vinte e Quatro de Maio, 1316 - Reboucas',\n",
       "  '-25.448215787776',\n",
       "  '-49.269060523457'],\n",
       " ['150181',\n",
       "  'Rua Vinte e Quatro de Maio, 1700 - Reboucas',\n",
       "  '-25.451248049822',\n",
       "  '-49.267590672916'],\n",
       " ['150182',\n",
       "  'Rua 24 de Maio, 2006 - Reboucas',\n",
       "  '-25.45389637276',\n",
       "  '-49.266295165962'],\n",
       " ['150005', 'Av. Pres. Kennedy, 700 - Reboucas', '-25.45518', '-49.26739'],\n",
       " ['150007', 'Av. Pres. Kennedy, 1090 - Agua Verde', '-25.45792', '-49.27044'],\n",
       " ['150008',\n",
       "  'Av. Pres. Kennedy, 1472 - Agua Verde',\n",
       "  '-25.460568162875',\n",
       "  '-49.27336682209'],\n",
       " ['150656',\n",
       "  'Rua Minas Gerais, 170 - Guaira',\n",
       "  '-25.463050620489',\n",
       "  '-49.274737418837'],\n",
       " ['150659',\n",
       "  'Rua Minas Gerais, 322 - Guaira',\n",
       "  '-25.464842640389',\n",
       "  '-49.273853630967'],\n",
       " ['150661',\n",
       "  'Rua Minas Gerais, 698 - Guaira',\n",
       "  '-25.466962759195',\n",
       "  '-49.272961796469'],\n",
       " ['150662',\n",
       "  'Rua Minas Gerais, 927 - Guaira',\n",
       "  '-25.469383111858',\n",
       "  '-49.27181381101'],\n",
       " ['150664',\n",
       "  'Rua Alagoas, 746 - Guaira',\n",
       "  '-25.470183427863',\n",
       "  '-49.273341329044'],\n",
       " ['150816',\n",
       "  'Rua Alagoas, 1038 - Guaira',\n",
       "  '-25.471190777201',\n",
       "  '-49.275988669342'],\n",
       " ['150667',\n",
       "  'Rua Alagoas, 1182 - Guaira',\n",
       "  '-25.471839738172',\n",
       "  '-49.277623475737'],\n",
       " ['150034',\n",
       "  'Rua Alagoas, 1618 - Guaira',\n",
       "  '-25.473237135961',\n",
       "  '-49.281267256683'],\n",
       " ['150767',\n",
       "  'Rua Alagoas, 1910 - Guaira',\n",
       "  '-25.474567721691',\n",
       "  '-49.284758151716'],\n",
       " ['150768',\n",
       "  'Rua Alagoas, 2200 - Guaira',\n",
       "  '-25.475354685393',\n",
       "  '-49.286861003584'],\n",
       " ['150769',\n",
       "  'Rua Jose de Almeida Garrete, 22 - Port?o',\n",
       "  '-25.47724769283',\n",
       "  '-49.286776514'],\n",
       " ['150770',\n",
       "  'Rua Paulo Betes, 104 - Novo Mundo',\n",
       "  '-25.479221101938',\n",
       "  '-49.285906137175'],\n",
       " ['150110',\n",
       "  'Rua Ildefonso Stockler de Franca, 587 - Novo Mundo',\n",
       "  '-25.481324018204',\n",
       "  '-49.287937910503'],\n",
       " ['150115',\n",
       "  'Rua Jose Palu, 346 - Novo Mundo',\n",
       "  '-25.482753786554',\n",
       "  '-49.288572252935'],\n",
       " ['150772',\n",
       "  'Rua Jose Palu, 712 - Novo Mundo',\n",
       "  '-25.485097552922',\n",
       "  '-49.289134175724'],\n",
       " ['150643',\n",
       "  'Rua Isidoro Siedeliski, 79 - Novo Mundo',\n",
       "  '-25.486982987129',\n",
       "  '-49.289060414976'],\n",
       " ['150645',\n",
       "  'Rua Isidoro Siedeliski, 187 - Novo Mundo',\n",
       "  '-25.4881294126',\n",
       "  '-49.288113595194'],\n",
       " ['150647',\n",
       "  'Rua Isidoro Siedeliski, 267- Novo Mundo',\n",
       "  '-25.489787896832',\n",
       "  '-49.286775172895'],\n",
       " ['150650',\n",
       "  'Rua das Andorinhas, 512 - Novo Mundo',\n",
       "  '-25.491186090211',\n",
       "  '-49.284231097645'],\n",
       " ['150651',\n",
       "  'Rua das Perdizes, 16 - Novo Mundo',\n",
       "  '-25.492493694247',\n",
       "  '-49.281699020272']]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher \n",
    "MATCH (l:Line {line_code:'666'})-[:HAS_TRIP]->(t:Trip {line_way:'Novo Mundo'})-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH(t)-[:ENDS_ON_POINT]->(bsf:BusStop)\n",
    "with bsi, bsf,t,l\n",
    "MATCH path=(bsi)-[:NEXT_STOP*0.. {line_code:l.line_code, line_way:t.line_way}]->(bsf)\n",
    "with nodes(path) as bss\n",
    "UNWIND bss AS bus_stop\n",
    "return bus_stop.number, bus_stop.name, bus_stop.latitude, bus_stop.longitude"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **PATH DA LINHA 666**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>path</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;number&#x27;: &#x27;102001&#x27;, &#x27;latitude&#x27;: &#x27;-25.43588731128&#x27;, &#x27;name&#x27;: &#x27;Praca Rui Barbosa - 666 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.274486810976&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 448.60710534822016, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;110022&#x27;, &#x27;latitude&#x27;: &#x27;-25.439756734365&#x27;, &#x27;name&#x27;: &#x27;Rua Vinte e Quatro de Maio, 280-350 - Centro&#x27;, &#x27;longitude&#x27;: &#x27;-49.273240017786&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 544.0926380234635, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;110023&#x27;, &#x27;latitude&#x27;: &#x27;-25.444237601078&#x27;, &#x27;name&#x27;: &#x27;Rua Vinte e Quatro de Maio, 712 - Reboucas&#x27;, &#x27;longitude&#x27;: &#x27;-49.27107815732&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 487.0823827324391, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150180&#x27;, &#x27;latitude&#x27;: &#x27;-25.448215787776&#x27;, &#x27;name&#x27;: &#x27;Rua Vinte e Quatro de Maio, 1316 - Reboucas&#x27;, &#x27;longitude&#x27;: &#x27;-49.269060523457&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 368.46813154653034, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150181&#x27;, &#x27;latitude&#x27;: &#x27;-25.451248049822&#x27;, &#x27;name&#x27;: &#x27;Rua Vinte e Quatro de Maio, 1700 - Reboucas&#x27;, &#x27;longitude&#x27;: &#x27;-49.267590672916&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 322.28822092631026, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150182&#x27;, &#x27;latitude&#x27;: &#x27;-25.45389637276&#x27;, &#x27;name&#x27;: &#x27;Rua 24 de Maio, 2006 - Reboucas&#x27;, &#x27;longitude&#x27;: &#x27;-49.266295165962&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 180.35619227798927, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150005&#x27;, &#x27;latitude&#x27;: &#x27;-25.45518&#x27;, &#x27;name&#x27;: &#x27;Av. Pres. Kennedy, 700 - Reboucas&#x27;, &#x27;longitude&#x27;: &#x27;-49.26739&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 432.4510727910561, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150007&#x27;, &#x27;latitude&#x27;: &#x27;-25.45792&#x27;, &#x27;name&#x27;: &#x27;Av. Pres. Kennedy, 1090 - Agua Verde&#x27;, &#x27;longitude&#x27;: &#x27;-49.27044&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 416.46176270205535, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150008&#x27;, &#x27;latitude&#x27;: &#x27;-25.460568162875&#x27;, &#x27;name&#x27;: &#x27;Av. Pres. Kennedy, 1472 - Agua Verde&#x27;, &#x27;longitude&#x27;: &#x27;-49.27336682209&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 308.77754655073716, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150656&#x27;, &#x27;latitude&#x27;: &#x27;-25.463050620489&#x27;, &#x27;name&#x27;: &#x27;Rua Minas Gerais, 170 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.274737418837&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 218.3689026974164, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150659&#x27;, &#x27;latitude&#x27;: &#x27;-25.464842640389&#x27;, &#x27;name&#x27;: &#x27;Rua Minas Gerais, 322 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.273853630967&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 252.45806493208667, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150661&#x27;, &#x27;latitude&#x27;: &#x27;-25.466962759195&#x27;, &#x27;name&#x27;: &#x27;Rua Minas Gerais, 698 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.272961796469&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 293.09597329740643, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150662&#x27;, &#x27;latitude&#x27;: &#x27;-25.469383111858&#x27;, &#x27;name&#x27;: &#x27;Rua Minas Gerais, 927 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.27181381101&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 177.49507529921556, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150664&#x27;, &#x27;latitude&#x27;: &#x27;-25.470183427863&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 746 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.273341329044&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 288.72373779262466, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150816&#x27;, &#x27;latitude&#x27;: &#x27;-25.471190777201&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 1038 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.275988669342&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 179.47792747344002, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150667&#x27;, &#x27;latitude&#x27;: &#x27;-25.471839738172&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 1182 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.277623475737&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 397.86453909671695, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150034&#x27;, &#x27;latitude&#x27;: &#x27;-25.473237135961&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 1618 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.281267256683&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 380.81215421131105, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150767&#x27;, &#x27;latitude&#x27;: &#x27;-25.474567721691&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 1910 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.284758151716&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 228.7671890070545, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150768&#x27;, &#x27;latitude&#x27;: &#x27;-25.475354685393&#x27;, &#x27;name&#x27;: &#x27;Rua Alagoas, 2200 - Guaira&#x27;, &#x27;longitude&#x27;: &#x27;-49.286861003584&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 210.89971163040477, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150769&#x27;, &#x27;latitude&#x27;: &#x27;-25.47724769283&#x27;, &#x27;name&#x27;: &#x27;Rua Jose de Almeida Garrete, 22 - Port?o&#x27;, &#x27;longitude&#x27;: &#x27;-49.286776514&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 236.45166267024965, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150770&#x27;, &#x27;latitude&#x27;: &#x27;-25.479221101938&#x27;, &#x27;name&#x27;: &#x27;Rua Paulo Betes, 104 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.285906137175&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 310.6266520868451, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150110&#x27;, &#x27;latitude&#x27;: &#x27;-25.481324018204&#x27;, &#x27;name&#x27;: &#x27;Rua Ildefonso Stockler de Franca, 587 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.287937910503&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 171.4518624027044, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150115&#x27;, &#x27;latitude&#x27;: &#x27;-25.482753786554&#x27;, &#x27;name&#x27;: &#x27;Rua Jose Palu, 346 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.288572252935&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 266.9475245575631, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150772&#x27;, &#x27;latitude&#x27;: &#x27;-25.485097552922&#x27;, &#x27;name&#x27;: &#x27;Rua Jose Palu, 712 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.289134175724&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 210.0165092035059, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150643&#x27;, &#x27;latitude&#x27;: &#x27;-25.486982987129&#x27;, &#x27;name&#x27;: &#x27;Rua Isidoro Siedeliski, 79 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.289060414976&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 159.1814660856966, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150645&#x27;, &#x27;latitude&#x27;: &#x27;-25.4881294126&#x27;, &#x27;name&#x27;: &#x27;Rua Isidoro Siedeliski, 187 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.288113595194&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 228.41401729285658, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150647&#x27;, &#x27;latitude&#x27;: &#x27;-25.489787896832&#x27;, &#x27;name&#x27;: &#x27;Rua Isidoro Siedeliski, 267- Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.286775172895&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 299.29269588750725, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150650&#x27;, &#x27;latitude&#x27;: &#x27;-25.491186090211&#x27;, &#x27;name&#x27;: &#x27;Rua das Andorinhas, 512 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.284231097645&#x27;}, {&#x27;line_code&#x27;: &#x27;666&#x27;, &#x27;distance&#x27;: 293.1249487568955, &#x27;line_way&#x27;: &#x27;Novo Mundo&#x27;}, {&#x27;number&#x27;: &#x27;150651&#x27;, &#x27;latitude&#x27;: &#x27;-25.492493694247&#x27;, &#x27;name&#x27;: &#x27;Rua das Perdizes, 16 - Novo Mundo&#x27;, &#x27;longitude&#x27;: &#x27;-49.281699020272&#x27;}]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'number': '102001',\n",
       "    'latitude': '-25.43588731128',\n",
       "    'name': 'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "    'longitude': '-49.274486810976'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 448.60710534822016,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '110022',\n",
       "    'latitude': '-25.439756734365',\n",
       "    'name': 'Rua Vinte e Quatro de Maio, 280-350 - Centro',\n",
       "    'longitude': '-49.273240017786'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 544.0926380234635,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '110023',\n",
       "    'latitude': '-25.444237601078',\n",
       "    'name': 'Rua Vinte e Quatro de Maio, 712 - Reboucas',\n",
       "    'longitude': '-49.27107815732'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 487.0823827324391,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150180',\n",
       "    'latitude': '-25.448215787776',\n",
       "    'name': 'Rua Vinte e Quatro de Maio, 1316 - Reboucas',\n",
       "    'longitude': '-49.269060523457'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 368.46813154653034,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150181',\n",
       "    'latitude': '-25.451248049822',\n",
       "    'name': 'Rua Vinte e Quatro de Maio, 1700 - Reboucas',\n",
       "    'longitude': '-49.267590672916'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 322.28822092631026,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150182',\n",
       "    'latitude': '-25.45389637276',\n",
       "    'name': 'Rua 24 de Maio, 2006 - Reboucas',\n",
       "    'longitude': '-49.266295165962'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 180.35619227798927,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150005',\n",
       "    'latitude': '-25.45518',\n",
       "    'name': 'Av. Pres. Kennedy, 700 - Reboucas',\n",
       "    'longitude': '-49.26739'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 432.4510727910561,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150007',\n",
       "    'latitude': '-25.45792',\n",
       "    'name': 'Av. Pres. Kennedy, 1090 - Agua Verde',\n",
       "    'longitude': '-49.27044'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 416.46176270205535,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150008',\n",
       "    'latitude': '-25.460568162875',\n",
       "    'name': 'Av. Pres. Kennedy, 1472 - Agua Verde',\n",
       "    'longitude': '-49.27336682209'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 308.77754655073716,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150656',\n",
       "    'latitude': '-25.463050620489',\n",
       "    'name': 'Rua Minas Gerais, 170 - Guaira',\n",
       "    'longitude': '-49.274737418837'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 218.3689026974164,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150659',\n",
       "    'latitude': '-25.464842640389',\n",
       "    'name': 'Rua Minas Gerais, 322 - Guaira',\n",
       "    'longitude': '-49.273853630967'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 252.45806493208667,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150661',\n",
       "    'latitude': '-25.466962759195',\n",
       "    'name': 'Rua Minas Gerais, 698 - Guaira',\n",
       "    'longitude': '-49.272961796469'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 293.09597329740643,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150662',\n",
       "    'latitude': '-25.469383111858',\n",
       "    'name': 'Rua Minas Gerais, 927 - Guaira',\n",
       "    'longitude': '-49.27181381101'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 177.49507529921556,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150664',\n",
       "    'latitude': '-25.470183427863',\n",
       "    'name': 'Rua Alagoas, 746 - Guaira',\n",
       "    'longitude': '-49.273341329044'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 288.72373779262466,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150816',\n",
       "    'latitude': '-25.471190777201',\n",
       "    'name': 'Rua Alagoas, 1038 - Guaira',\n",
       "    'longitude': '-49.275988669342'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 179.47792747344002,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150667',\n",
       "    'latitude': '-25.471839738172',\n",
       "    'name': 'Rua Alagoas, 1182 - Guaira',\n",
       "    'longitude': '-49.277623475737'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 397.86453909671695,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150034',\n",
       "    'latitude': '-25.473237135961',\n",
       "    'name': 'Rua Alagoas, 1618 - Guaira',\n",
       "    'longitude': '-49.281267256683'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 380.81215421131105,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150767',\n",
       "    'latitude': '-25.474567721691',\n",
       "    'name': 'Rua Alagoas, 1910 - Guaira',\n",
       "    'longitude': '-49.284758151716'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 228.7671890070545,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150768',\n",
       "    'latitude': '-25.475354685393',\n",
       "    'name': 'Rua Alagoas, 2200 - Guaira',\n",
       "    'longitude': '-49.286861003584'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 210.89971163040477,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150769',\n",
       "    'latitude': '-25.47724769283',\n",
       "    'name': 'Rua Jose de Almeida Garrete, 22 - Port?o',\n",
       "    'longitude': '-49.286776514'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 236.45166267024965,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150770',\n",
       "    'latitude': '-25.479221101938',\n",
       "    'name': 'Rua Paulo Betes, 104 - Novo Mundo',\n",
       "    'longitude': '-49.285906137175'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 310.6266520868451,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150110',\n",
       "    'latitude': '-25.481324018204',\n",
       "    'name': 'Rua Ildefonso Stockler de Franca, 587 - Novo Mundo',\n",
       "    'longitude': '-49.287937910503'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 171.4518624027044,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150115',\n",
       "    'latitude': '-25.482753786554',\n",
       "    'name': 'Rua Jose Palu, 346 - Novo Mundo',\n",
       "    'longitude': '-49.288572252935'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 266.9475245575631,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150772',\n",
       "    'latitude': '-25.485097552922',\n",
       "    'name': 'Rua Jose Palu, 712 - Novo Mundo',\n",
       "    'longitude': '-49.289134175724'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 210.0165092035059,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150643',\n",
       "    'latitude': '-25.486982987129',\n",
       "    'name': 'Rua Isidoro Siedeliski, 79 - Novo Mundo',\n",
       "    'longitude': '-49.289060414976'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 159.1814660856966,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150645',\n",
       "    'latitude': '-25.4881294126',\n",
       "    'name': 'Rua Isidoro Siedeliski, 187 - Novo Mundo',\n",
       "    'longitude': '-49.288113595194'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 228.41401729285658,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150647',\n",
       "    'latitude': '-25.489787896832',\n",
       "    'name': 'Rua Isidoro Siedeliski, 267- Novo Mundo',\n",
       "    'longitude': '-49.286775172895'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 299.29269588750725,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150650',\n",
       "    'latitude': '-25.491186090211',\n",
       "    'name': 'Rua das Andorinhas, 512 - Novo Mundo',\n",
       "    'longitude': '-49.284231097645'},\n",
       "   {'line_code': '666',\n",
       "    'distance': 293.1249487568955,\n",
       "    'line_way': 'Novo Mundo'},\n",
       "   {'number': '150651',\n",
       "    'latitude': '-25.492493694247',\n",
       "    'name': 'Rua das Perdizes, 16 - Novo Mundo',\n",
       "    'longitude': '-49.281699020272'}]]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line {line_code:'666'})-[:HAS_TRIP]->(t:Trip {line_way:'Novo Mundo'})-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH(t)-[:ENDS_ON_POINT]->(bsf:BusStop)\n",
    "with bsi, bsf\n",
    "MATCH path=(bsi)-[:NEXT_STOP*0.. {line_code:'666', line_way:'Novo Mundo'}]->(bsf) return path"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **VELOCIDADE MÉDIA DA LINHA 666 AO LONGO DO DIA (POR HORA)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>bus_stop.number</th>\n",
       "        <th>bus_stop.name</th>\n",
       "        <th>h.value</th>\n",
       "        <th>ev.moving_status</th>\n",
       "        <th>count(ev)</th>\n",
       "        <th>avg_speed</th>\n",
       "        <th>stdDevP_speed</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>1</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>2</td>\n",
       "        <td>1.9224999999999999</td>\n",
       "        <td>1.5725000000000002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>1</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>22.99</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>2</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>27.11</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>2</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>4</td>\n",
       "        <td>3.91</td>\n",
       "        <td>4.730656666890972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>3</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>4</td>\n",
       "        <td>3.2649999999999997</td>\n",
       "        <td>5.332535747653267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>3</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>25.77</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>4</td>\n",
       "        <td>STOPPED</td>\n",
       "        <td>4</td>\n",
       "        <td>3.69125</td>\n",
       "        <td>4.137762642721305</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>4</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>19.14</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>102001</td>\n",
       "        <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "        <td>5</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>18.49</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>110022</td>\n",
       "        <td>Rua Vinte e Quatro de Maio, 280-350 - Centro</td>\n",
       "        <td>1</td>\n",
       "        <td>MOVING</td>\n",
       "        <td>1</td>\n",
       "        <td>33.7</td>\n",
       "        <td>0.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  1,\n",
       "  'STOPPED',\n",
       "  2,\n",
       "  1.9224999999999999,\n",
       "  1.5725000000000002],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  1,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  22.99,\n",
       "  0.0],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  2,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  27.11,\n",
       "  0.0],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  2,\n",
       "  'STOPPED',\n",
       "  4,\n",
       "  3.91,\n",
       "  4.730656666890972],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  3,\n",
       "  'STOPPED',\n",
       "  4,\n",
       "  3.2649999999999997,\n",
       "  5.332535747653267],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  3,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  25.77,\n",
       "  0.0],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  4,\n",
       "  'STOPPED',\n",
       "  4,\n",
       "  3.69125,\n",
       "  4.137762642721305],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  4,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  19.14,\n",
       "  0.0],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  5,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  18.49,\n",
       "  0.0],\n",
       " ['110022',\n",
       "  'Rua Vinte e Quatro de Maio, 280-350 - Centro',\n",
       "  1,\n",
       "  'MOVING',\n",
       "  1,\n",
       "  33.7,\n",
       "  0.0]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line {line_code:'666'})-[:HAS_TRIP]->(t:Trip {line_way:'Novo Mundo'})-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH(t)-[:ENDS_ON_POINT]->(bsf:BusStop)\n",
    "with bsi, bsf\n",
    "MATCH path=(bsi)-[:NEXT_STOP*0.. {line_code:'666', line_way:'Novo Mundo'}]->(bsf) \n",
    "with nodes(path) as bss\n",
    "UNWIND bss AS bus_stop\n",
    "MATCH (bus_stop)<-[:IS_NEAR_BY]-(ev:Event)<-[:HAS_EVENT]-(h:Hour)\n",
    "return bus_stop.number, bus_stop.name, h.value, ev.moving_status, count(ev), avg(toFloat(ev.avg_velocity)) as avg_speed, stDevP(toFloat(ev.avg_velocity)) as stdDevP_speed\n",
    "order by bus_stop.number, h.value limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **VELOCIDADE MÉDIA DA LINHA 666 AO LONGO DO DIA (SUMARIZADO)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <thead>\n",
       "        <tr>\n",
       "            <th>bus_stop.number</th>\n",
       "            <th>bus_stop.name</th>\n",
       "            <th>ev.moving_status</th>\n",
       "            <th>count(ev)</th>\n",
       "            <th>avg_speed</th>\n",
       "            <th>stdDevP_speed</th>\n",
       "        </tr>\n",
       "    </thead>\n",
       "    <tbody>\n",
       "        <tr>\n",
       "            <td>102001</td>\n",
       "            <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "            <td>MOVING</td>\n",
       "            <td>5</td>\n",
       "            <td>22.7</td>\n",
       "            <td>3.4454259533474234</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>102001</td>\n",
       "            <td>Praca Rui Barbosa - 666 - Novo Mundo</td>\n",
       "            <td>STOPPED</td>\n",
       "            <td>22</td>\n",
       "            <td>3.0727272727272728</td>\n",
       "            <td>3.811954201549481</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110022</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 280-350 - Centro</td>\n",
       "            <td>STOPPED</td>\n",
       "            <td>264</td>\n",
       "            <td>6.979356060606063</td>\n",
       "            <td>3.4133412472271485</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110022</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 280-350 - Centro</td>\n",
       "            <td>MOVING</td>\n",
       "            <td>414</td>\n",
       "            <td>25.584130434782622</td>\n",
       "            <td>5.090043928171567</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110023</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 712 - Reboucas</td>\n",
       "            <td>STOPPED</td>\n",
       "            <td>85</td>\n",
       "            <td>7.12737254901961</td>\n",
       "            <td>2.6853314491746043</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>110023</td>\n",
       "            <td>Rua Vinte e Quatro de Maio, 712 - Reboucas</td>\n",
       "            <td>MOVING</td>\n",
       "            <td>101</td>\n",
       "            <td>26.6840099009901</td>\n",
       "            <td>4.8901722023072765</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150005</td>\n",
       "            <td>Av. Pres. Kennedy, 700 - Reboucas</td>\n",
       "            <td>MOVING</td>\n",
       "            <td>240</td>\n",
       "            <td>35.65306249999993</td>\n",
       "            <td>7.684190839005785</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150005</td>\n",
       "            <td>Av. Pres. Kennedy, 700 - Reboucas</td>\n",
       "            <td>STOPPED</td>\n",
       "            <td>77</td>\n",
       "            <td>7.765324675324674</td>\n",
       "            <td>2.961070394569998</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150007</td>\n",
       "            <td>Av. Pres. Kennedy, 1090 - Agua Verde</td>\n",
       "            <td>STOPPED</td>\n",
       "            <td>139</td>\n",
       "            <td>7.423812949640286</td>\n",
       "            <td>2.604393050070739</td>\n",
       "        </tr>\n",
       "        <tr>\n",
       "            <td>150007</td>\n",
       "            <td>Av. Pres. Kennedy, 1090 - Agua Verde</td>\n",
       "            <td>MOVING</td>\n",
       "            <td>137</td>\n",
       "            <td>29.259562043795622</td>\n",
       "            <td>3.8800679350311813</td>\n",
       "        </tr>\n",
       "    </tbody>\n",
       "</table>"
      ],
      "text/plain": [
       "[['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  'MOVING',\n",
       "  5,\n",
       "  22.7,\n",
       "  3.4454259533474234],\n",
       " ['102001',\n",
       "  'Praca Rui Barbosa - 666 - Novo Mundo',\n",
       "  'STOPPED',\n",
       "  22,\n",
       "  3.0727272727272728,\n",
       "  3.811954201549481],\n",
       " ['110022',\n",
       "  'Rua Vinte e Quatro de Maio, 280-350 - Centro',\n",
       "  'STOPPED',\n",
       "  264,\n",
       "  6.979356060606063,\n",
       "  3.4133412472271485],\n",
       " ['110022',\n",
       "  'Rua Vinte e Quatro de Maio, 280-350 - Centro',\n",
       "  'MOVING',\n",
       "  414,\n",
       "  25.584130434782622,\n",
       "  5.090043928171567],\n",
       " ['110023',\n",
       "  'Rua Vinte e Quatro de Maio, 712 - Reboucas',\n",
       "  'STOPPED',\n",
       "  85,\n",
       "  7.12737254901961,\n",
       "  2.6853314491746043],\n",
       " ['110023',\n",
       "  'Rua Vinte e Quatro de Maio, 712 - Reboucas',\n",
       "  'MOVING',\n",
       "  101,\n",
       "  26.6840099009901,\n",
       "  4.8901722023072765],\n",
       " ['150005',\n",
       "  'Av. Pres. Kennedy, 700 - Reboucas',\n",
       "  'MOVING',\n",
       "  240,\n",
       "  35.65306249999993,\n",
       "  7.684190839005785],\n",
       " ['150005',\n",
       "  'Av. Pres. Kennedy, 700 - Reboucas',\n",
       "  'STOPPED',\n",
       "  77,\n",
       "  7.765324675324674,\n",
       "  2.961070394569998],\n",
       " ['150007',\n",
       "  'Av. Pres. Kennedy, 1090 - Agua Verde',\n",
       "  'STOPPED',\n",
       "  139,\n",
       "  7.423812949640286,\n",
       "  2.604393050070739],\n",
       " ['150007',\n",
       "  'Av. Pres. Kennedy, 1090 - Agua Verde',\n",
       "  'MOVING',\n",
       "  137,\n",
       "  29.259562043795622,\n",
       "  3.8800679350311813]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (l:Line {line_code:'666'})-[:HAS_TRIP]->(t:Trip {line_way:'Novo Mundo'})-[:STARTS_ON_POINT]->(bsi:BusStop)\n",
    "MATCH(t)-[:ENDS_ON_POINT]->(bsf:BusStop)\n",
    "with bsi, bsf\n",
    "MATCH path=(bsi)-[:NEXT_STOP*0.. {line_code:'666', line_way:'Novo Mundo'}]->(bsf) \n",
    "with nodes(path) as bss\n",
    "UNWIND bss AS bus_stop\n",
    "MATCH (bus_stop)<-[:IS_NEAR_BY]-(ev:Event)\n",
    "return bus_stop.number, bus_stop.name, ev.moving_status, count(ev), avg(toFloat(ev.avg_velocity)) as avg_speed, stDevP(toFloat(ev.avg_velocity)) as stdDevP_speed\n",
    "order by bus_stop.number limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### CALCULAR TEMPO MÉDIO DE DESLOCAMENTO ENTRE DOIS PONTOS DE UMA LINHA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "105 rows affected.\n"
     ]
    }
   ],
   "source": [
    "results = %cypher \\\n",
    "MATCH(l:Line)-[:HAS_TRIP]-(t:Trip)-[:HAS_BUS_STOP]->(bss:BusStop {number:'110048'})-[:NEXT_STOP]->(bsf:BusStop {number:'110049'}) \\\n",
    "with l,t,bss, bsf  \\\n",
    "MATCH(ev:Event)-[:IS_NEAR_BY]->(bss)  \\\n",
    "MATCH(evf:Event )-[:IS_NEAR_BY]->(bsf)  \\\n",
    "MATCH(ev)-[:MOVED_TO*..6]->(evf)<-[:HAS_EVENT]-(t)  \\\n",
    "return distinct l.line_code,t.line_way,bss.number,bsf.number,ev.vehicle, ev.event_timestamp, evf.event_timestamp  order by ev.event_timestamp, evf.event_timestamp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = results.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(105, 7)"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "df['delta_time'] = pd.to_datetime(df['evf.event_timestamp']) - pd.to_datetime(df['ev.event_timestamp'])\n",
    "df['delta_time_in_sec'] = df['delta_time'].dt.total_seconds()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>l.line_code</th>\n",
       "      <th>t.line_way</th>\n",
       "      <th>bss.number</th>\n",
       "      <th>bsf.number</th>\n",
       "      <th>ev.vehicle</th>\n",
       "      <th>ev.event_timestamp</th>\n",
       "      <th>evf.event_timestamp</th>\n",
       "      <th>delta_time</th>\n",
       "      <th>delta_time_in_sec</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 06:21:06</td>\n",
       "      <td>2019-05-02 06:22:11</td>\n",
       "      <td>00:01:05</td>\n",
       "      <td>65.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 06:21:27</td>\n",
       "      <td>2019-05-02 06:22:11</td>\n",
       "      <td>00:00:44</td>\n",
       "      <td>44.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 06:47:44</td>\n",
       "      <td>2019-05-02 06:48:54</td>\n",
       "      <td>00:01:10</td>\n",
       "      <td>70.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 06:48:10</td>\n",
       "      <td>2019-05-02 06:48:54</td>\n",
       "      <td>00:00:44</td>\n",
       "      <td>44.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN998</td>\n",
       "      <td>2019-05-02 07:05:59</td>\n",
       "      <td>2019-05-02 07:06:52</td>\n",
       "      <td>00:00:53</td>\n",
       "      <td>53.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 07:13:34</td>\n",
       "      <td>2019-05-02 07:14:30</td>\n",
       "      <td>00:00:56</td>\n",
       "      <td>56.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN998</td>\n",
       "      <td>2019-05-02 07:25:34</td>\n",
       "      <td>2019-05-02 07:26:27</td>\n",
       "      <td>00:00:53</td>\n",
       "      <td>53.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN998</td>\n",
       "      <td>2019-05-02 07:25:41</td>\n",
       "      <td>2019-05-02 07:26:27</td>\n",
       "      <td>00:00:46</td>\n",
       "      <td>46.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN997</td>\n",
       "      <td>2019-05-02 07:38:45</td>\n",
       "      <td>2019-05-02 07:39:40</td>\n",
       "      <td>00:00:55</td>\n",
       "      <td>55.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110048</td>\n",
       "      <td>110049</td>\n",
       "      <td>BN998</td>\n",
       "      <td>2019-05-02 07:52:08</td>\n",
       "      <td>2019-05-02 07:53:18</td>\n",
       "      <td>00:01:10</td>\n",
       "      <td>70.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  l.line_code t.line_way bss.number bsf.number ev.vehicle  \\\n",
       "0  001         Horario    110048     110049     BN997       \n",
       "1  001         Horario    110048     110049     BN997       \n",
       "2  001         Horario    110048     110049     BN997       \n",
       "3  001         Horario    110048     110049     BN997       \n",
       "4  001         Horario    110048     110049     BN998       \n",
       "5  001         Horario    110048     110049     BN997       \n",
       "6  001         Horario    110048     110049     BN998       \n",
       "7  001         Horario    110048     110049     BN998       \n",
       "8  001         Horario    110048     110049     BN997       \n",
       "9  001         Horario    110048     110049     BN998       \n",
       "\n",
       "    ev.event_timestamp  evf.event_timestamp delta_time  delta_time_in_sec  \n",
       "0  2019-05-02 06:21:06  2019-05-02 06:22:11 00:01:05    65.0               \n",
       "1  2019-05-02 06:21:27  2019-05-02 06:22:11 00:00:44    44.0               \n",
       "2  2019-05-02 06:47:44  2019-05-02 06:48:54 00:01:10    70.0               \n",
       "3  2019-05-02 06:48:10  2019-05-02 06:48:54 00:00:44    44.0               \n",
       "4  2019-05-02 07:05:59  2019-05-02 07:06:52 00:00:53    53.0               \n",
       "5  2019-05-02 07:13:34  2019-05-02 07:14:30 00:00:56    56.0               \n",
       "6  2019-05-02 07:25:34  2019-05-02 07:26:27 00:00:53    53.0               \n",
       "7  2019-05-02 07:25:41  2019-05-02 07:26:27 00:00:46    46.0               \n",
       "8  2019-05-02 07:38:45  2019-05-02 07:39:40 00:00:55    55.0               \n",
       "9  2019-05-02 07:52:08  2019-05-02 07:53:18 00:01:10    70.0               "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **II - CALCULAR TEMPOS MÉDIOS DE DESCOLAMENTO ENTRE DOIS PONTOS DE TODAS AS LINHAS**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "904328 rows affected.\n"
     ]
    }
   ],
   "source": [
    "results = %cypher  \\\n",
    "MATCH(y:Year)-[:CONTAINS]->(m:Month)-[:CONTAINS]->(d:Day)-[:HAS_LINE]->(l:Line)-[:HAS_TRIP]->(t:Trip)-[:HAS_BUS_STOP]->(bss:BusStop)-[n:NEXT_STOP ]->(bsf:BusStop) \\\n",
    "with y,m,d,l,t,bss, bsf, n \\\n",
    "MATCH(h1:Hour)-[:HAS_EVENT]->(ev:Event)-[:IS_NEAR_BY]->(bss)  \\\n",
    "MATCH(h2:Hour)-[:HAS_EVENT]->(evf:Event )-[:IS_NEAR_BY]->(bsf)  \\\n",
    "MATCH(ev)-[:MOVED_TO*..6]->(evf)<-[:HAS_EVENT]-(t)  \\\n",
    "return distinct y.value as year, m.value as month, d.value as day,h2.value as hour, \\\n",
    "        l.line_code as line_code, t.line_way as line_way, bss.number as start_point, \\\n",
    "        bsf.number as end_point, n.distance, ev.vehicle as vehicle, ev.event_timestamp as start_timestamp, evf.event_timestamp as end_timestamp \\\n",
    "order by start_timestamp, end_timestamp "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = results.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>hour</th>\n",
       "      <th>line_code</th>\n",
       "      <th>line_way</th>\n",
       "      <th>start_point</th>\n",
       "      <th>end_point</th>\n",
       "      <th>n.distance</th>\n",
       "      <th>vehicle</th>\n",
       "      <th>start_timestamp</th>\n",
       "      <th>end_timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150634</td>\n",
       "      <td>150634</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>JC859</td>\n",
       "      <td>2019-05-01 01:17:48</td>\n",
       "      <td>2019-05-01 01:17:52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150634</td>\n",
       "      <td>150634</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>JC859</td>\n",
       "      <td>2019-05-01 01:17:48</td>\n",
       "      <td>2019-05-01 01:17:52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150634</td>\n",
       "      <td>150634</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>JC859</td>\n",
       "      <td>2019-05-01 01:17:48</td>\n",
       "      <td>2019-05-01 01:18:03</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150634</td>\n",
       "      <td>150634</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>JC859</td>\n",
       "      <td>2019-05-01 01:17:48</td>\n",
       "      <td>2019-05-01 01:18:03</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>789</td>\n",
       "      <td>Caiua</td>\n",
       "      <td>150634</td>\n",
       "      <td>180641</td>\n",
       "      <td>330.266538</td>\n",
       "      <td>JC859</td>\n",
       "      <td>2019-05-01 01:17:48</td>\n",
       "      <td>2019-05-01 01:18:43</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  month  day  hour line_code line_way start_point end_point  \\\n",
       "0  2019  5      2    1     789       Caiua    150634      150634     \n",
       "1  2019  5      1    1     789       Caiua    150634      150634     \n",
       "2  2019  5      2    1     789       Caiua    150634      150634     \n",
       "3  2019  5      1    1     789       Caiua    150634      150634     \n",
       "4  2019  5      2    1     789       Caiua    150634      180641     \n",
       "\n",
       "   n.distance vehicle      start_timestamp        end_timestamp  \n",
       "0  0.000000    JC859   2019-05-01 01:17:48  2019-05-01 01:17:52  \n",
       "1  0.000000    JC859   2019-05-01 01:17:48  2019-05-01 01:17:52  \n",
       "2  0.000000    JC859   2019-05-01 01:17:48  2019-05-01 01:18:03  \n",
       "3  0.000000    JC859   2019-05-01 01:17:48  2019-05-01 01:18:03  \n",
       "4  330.266538  JC859   2019-05-01 01:17:48  2019-05-01 01:18:43  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "df['start_timestamp'] = pd.to_datetime(df['start_timestamp'])\n",
    "df['end_timestamp'] = pd.to_datetime(df['end_timestamp'])\n",
    "df['delta_time'] = df['end_timestamp'] - df['start_timestamp']\n",
    "df['delta_time_in_sec'] = df['delta_time'].dt.total_seconds()\n",
    "df = df.sort_values(by=['line_code','line_way','vehicle','start_timestamp'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "#df.to_csv(\"times.csv\",index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_grouped = df.groupby(['year','month','day','line_code','line_way','start_point','end_point'],as_index=False)['delta_time_in_sec'].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>line_code</th>\n",
       "      <th>line_way</th>\n",
       "      <th>start_point</th>\n",
       "      <th>end_point</th>\n",
       "      <th>delta_time_in_sec</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>101011</td>\n",
       "      <td>103506</td>\n",
       "      <td>196.996429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>102034</td>\n",
       "      <td>103505</td>\n",
       "      <td>120.816667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>103505</td>\n",
       "      <td>110016</td>\n",
       "      <td>131.547170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>103506</td>\n",
       "      <td>110048</td>\n",
       "      <td>265.335938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>001</td>\n",
       "      <td>Horario</td>\n",
       "      <td>110016</td>\n",
       "      <td>110017</td>\n",
       "      <td>54.650000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  month  day line_code line_way start_point end_point  \\\n",
       "0  2019  5      1    001       Horario  101011      103506     \n",
       "1  2019  5      1    001       Horario  102034      103505     \n",
       "2  2019  5      1    001       Horario  103505      110016     \n",
       "3  2019  5      1    001       Horario  103506      110048     \n",
       "4  2019  5      1    001       Horario  110016      110017     \n",
       "\n",
       "   delta_time_in_sec  \n",
       "0  196.996429         \n",
       "1  120.816667         \n",
       "2  131.547170         \n",
       "3  265.335938         \n",
       "4  54.650000          "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_grouped.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>busstop_number</th>\n",
       "      <th>name</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "      <th>time_span</th>\n",
       "      <th>next_time_span</th>\n",
       "      <th>count_lines</th>\n",
       "      <th>count_vehicles</th>\n",
       "      <th>set_vehicles</th>\n",
       "      <th>set_lines</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-01 06:00:00</td>\n",
       "      <td>2019-05-01 06:10:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN400]</td>\n",
       "      <td>[928]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-01 07:00:00</td>\n",
       "      <td>2019-05-01 07:10:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN400]</td>\n",
       "      <td>[928]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-01 08:00:00</td>\n",
       "      <td>2019-05-01 08:10:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN400]</td>\n",
       "      <td>[928]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-01 09:00:00</td>\n",
       "      <td>2019-05-01 09:10:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN400]</td>\n",
       "      <td>[928]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-01 10:00:00</td>\n",
       "      <td>2019-05-01 10:10:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN400]</td>\n",
       "      <td>[928]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  month  day busstop_number  \\\n",
       "0  2019  5      1    660104          \n",
       "1  2019  5      1    660104          \n",
       "2  2019  5      1    660104          \n",
       "3  2019  5      1    660104          \n",
       "4  2019  5      1    660104          \n",
       "\n",
       "                                                 name   latitude  longitude  \\\n",
       "0  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "1  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "2  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "3  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "4  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "\n",
       "            time_span      next_time_span  count_lines  count_vehicles  \\\n",
       "0 2019-05-01 06:00:00 2019-05-01 06:10:00  1            1                \n",
       "1 2019-05-01 07:00:00 2019-05-01 07:10:00  1            1                \n",
       "2 2019-05-01 08:00:00 2019-05-01 08:10:00  1            1                \n",
       "3 2019-05-01 09:00:00 2019-05-01 09:10:00  1            1                \n",
       "4 2019-05-01 10:00:00 2019-05-01 10:10:00  1            1                \n",
       "\n",
       "  set_vehicles set_lines  \n",
       "0  [MN400]      [928]     \n",
       "1  [MN400]      [928]     \n",
       "2  [MN400]      [928]     \n",
       "3  [MN400]      [928]     \n",
       "4  [MN400]      [928]     "
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>month</th>\n",
       "      <th>day</th>\n",
       "      <th>busstop_number</th>\n",
       "      <th>name</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "      <th>time_span</th>\n",
       "      <th>next_time_span</th>\n",
       "      <th>count_lines</th>\n",
       "      <th>count_vehicles</th>\n",
       "      <th>set_vehicles</th>\n",
       "      <th>set_lines</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-02 05:10:00</td>\n",
       "      <td>2019-05-02 05:20:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN403]</td>\n",
       "      <td>[911]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-02 05:50:00</td>\n",
       "      <td>2019-05-02 06:00:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN403]</td>\n",
       "      <td>[911]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-02 06:10:00</td>\n",
       "      <td>2019-05-02 06:20:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN405]</td>\n",
       "      <td>[911]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-02 06:30:00</td>\n",
       "      <td>2019-05-02 06:40:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN403]</td>\n",
       "      <td>[911]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2019</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>660104</td>\n",
       "      <td>Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR</td>\n",
       "      <td>-25.38146</td>\n",
       "      <td>-49.36393</td>\n",
       "      <td>2019-05-02 06:50:00</td>\n",
       "      <td>2019-05-02 07:00:00</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>[MN405]</td>\n",
       "      <td>[911]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year  month  day busstop_number  \\\n",
       "0  2019  5      2    660104          \n",
       "1  2019  5      2    660104          \n",
       "2  2019  5      2    660104          \n",
       "3  2019  5      2    660104          \n",
       "4  2019  5      2    660104          \n",
       "\n",
       "                                                 name   latitude  longitude  \\\n",
       "0  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "1  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "2  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "3  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "4  Rua Amazonas, 197 - Jd. Cecilia - Campo Magro - PR  -25.38146  -49.36393   \n",
       "\n",
       "            time_span      next_time_span  count_lines  count_vehicles  \\\n",
       "0 2019-05-02 05:10:00 2019-05-02 05:20:00  1            1                \n",
       "1 2019-05-02 05:50:00 2019-05-02 06:00:00  1            1                \n",
       "2 2019-05-02 06:10:00 2019-05-02 06:20:00  1            1                \n",
       "3 2019-05-02 06:30:00 2019-05-02 06:40:00  1            1                \n",
       "4 2019-05-02 06:50:00 2019-05-02 07:00:00  1            1                \n",
       "\n",
       "  set_vehicles set_lines  \n",
       "0  [MN403]      [911]     \n",
       "1  [MN403]      [911]     \n",
       "2  [MN405]      [911]     \n",
       "3  [MN403]      [911]     \n",
       "4  [MN405]      [911]     "
      ]
     },
     "execution_count": 87,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>busstop_number</th>\n",
       "      <th>name</th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "      <th>nr_medio_linhas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>150332</td>\n",
       "      <td>Rua Leon Nicolas, 2081 - Cap?o Raso</td>\n",
       "      <td>-25.515159644727</td>\n",
       "      <td>-49.294443608469</td>\n",
       "      <td>2.971014</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>150331</td>\n",
       "      <td>Av. Winston Churchill, 2472 - Cap?o Raso</td>\n",
       "      <td>-25.518348864079</td>\n",
       "      <td>-49.29566769888</td>\n",
       "      <td>2.827778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>150751</td>\n",
       "      <td>Av. Winston Churchill, 2677 - Cap?o Raso</td>\n",
       "      <td>-25.520731874323</td>\n",
       "      <td>-49.295383384725</td>\n",
       "      <td>2.748768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>110022</td>\n",
       "      <td>Rua Vinte e Quatro de Maio, 280-350 - Centro</td>\n",
       "      <td>-25.439756734365</td>\n",
       "      <td>-49.273240017786</td>\n",
       "      <td>2.531792</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>160244</td>\n",
       "      <td>Rua Emanoel Voluz, 284 - Pinheirinho</td>\n",
       "      <td>-25.524017075104</td>\n",
       "      <td>-49.292992119479</td>\n",
       "      <td>2.360825</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>110024</td>\n",
       "      <td>Rua Alferes Poli, 787 - Reboucas</td>\n",
       "      <td>-25.443478176732</td>\n",
       "      <td>-49.270140950921</td>\n",
       "      <td>2.301887</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>150634</td>\n",
       "      <td>Av. Iguacu, 2612 - Agua Verde</td>\n",
       "      <td>-25.448942375096</td>\n",
       "      <td>-49.287531555838</td>\n",
       "      <td>2.296296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>110026</td>\n",
       "      <td>Rua Alferes Poli, 400 - Reboucas</td>\n",
       "      <td>-25.440705808683</td>\n",
       "      <td>-49.271456482887</td>\n",
       "      <td>2.288462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>150631</td>\n",
       "      <td>Av. Iguacu, 1788 - Agua Verde</td>\n",
       "      <td>-25.445710238874</td>\n",
       "      <td>-49.278719158119</td>\n",
       "      <td>2.242857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>110208</td>\n",
       "      <td>Av. Iguacu, 1184 - Reboucas</td>\n",
       "      <td>-25.443296676303</td>\n",
       "      <td>-49.272462905592</td>\n",
       "      <td>2.242718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>150330</td>\n",
       "      <td>Av. Winston Churchill, 2546 - Cap?o Raso</td>\n",
       "      <td>-25.519229941942</td>\n",
       "      <td>-49.295454463264</td>\n",
       "      <td>2.188811</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>160245</td>\n",
       "      <td>Rua Mal. Otavio Saldanha Maza, 3046 - Cap?o Raso</td>\n",
       "      <td>-25.525816036122</td>\n",
       "      <td>-49.293896099826</td>\n",
       "      <td>2.182857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>110211</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 1309 - Reboucas</td>\n",
       "      <td>-25.445197981519</td>\n",
       "      <td>-49.272273809856</td>\n",
       "      <td>2.156627</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>140228</td>\n",
       "      <td>Rua Engenheiro Benedito Mario da Silva, 570 - Cajuru</td>\n",
       "      <td>-25.46962</td>\n",
       "      <td>-49.20589</td>\n",
       "      <td>2.091549</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>150635</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 2676 - Agua Verde</td>\n",
       "      <td>-25.449985020239</td>\n",
       "      <td>-49.284862757868</td>\n",
       "      <td>2.079268</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>110210</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 1708 - Reboucas</td>\n",
       "      <td>-25.446516767314</td>\n",
       "      <td>-49.27578884477</td>\n",
       "      <td>2.056250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>110122</td>\n",
       "      <td>Rua Bar?o do Serro Azul, 217 - S?o Francisco</td>\n",
       "      <td>-25.427695151901</td>\n",
       "      <td>-49.271025854244</td>\n",
       "      <td>2.046667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>170051</td>\n",
       "      <td>Rua Joaquim Sim?es, 10 - Pinheirinho</td>\n",
       "      <td>-25.52114093887</td>\n",
       "      <td>-49.296043208143</td>\n",
       "      <td>2.016304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>110126</td>\n",
       "      <td>Rua Heitor S de Franca, 93 - Centro Civico</td>\n",
       "      <td>-25.423318109898</td>\n",
       "      <td>-49.268572186508</td>\n",
       "      <td>1.993827</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>150169</td>\n",
       "      <td>Rua Clara Polsin, 140 - Novo Mundo</td>\n",
       "      <td>-25.491665473459</td>\n",
       "      <td>-49.288603003058</td>\n",
       "      <td>1.982036</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>150636</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 2349 - Agua Verde</td>\n",
       "      <td>-25.448776471378</td>\n",
       "      <td>-49.281718062548</td>\n",
       "      <td>1.920000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>180535</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 3047 - Agua Verde</td>\n",
       "      <td>-25.45146710446</td>\n",
       "      <td>-49.288747937626</td>\n",
       "      <td>1.901515</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>110037</td>\n",
       "      <td>Av. Manoel Ribas, 531 - Merces</td>\n",
       "      <td>-25.422482678274</td>\n",
       "      <td>-49.284327553297</td>\n",
       "      <td>1.876543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>180074</td>\n",
       "      <td>Rua Pedro Gusso, 4150 - Cidade Industrial</td>\n",
       "      <td>-25.511476635367</td>\n",
       "      <td>-49.328306098635</td>\n",
       "      <td>1.858824</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>110209</td>\n",
       "      <td>Av. Iguacu, 1438 - Reboucas</td>\n",
       "      <td>-25.444475004665</td>\n",
       "      <td>-49.275511236137</td>\n",
       "      <td>1.853211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>170121</td>\n",
       "      <td>Rodovia BR476 - Pista Lateral, 20916 - Pinheirinho</td>\n",
       "      <td>-25.53378939418</td>\n",
       "      <td>-49.301047795606</td>\n",
       "      <td>1.832370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>150633</td>\n",
       "      <td>Av. Iguacu, 2436 - Agua Verde</td>\n",
       "      <td>-25.447883978109</td>\n",
       "      <td>-49.284622700161</td>\n",
       "      <td>1.816327</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>140375</td>\n",
       "      <td>Rua Leonardo Novicki, 8 - Cajuru</td>\n",
       "      <td>-25.467723882337</td>\n",
       "      <td>-49.19849188643</td>\n",
       "      <td>1.815476</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>110133</td>\n",
       "      <td>Rua Trajano Reis, 296 - S?o Francisco</td>\n",
       "      <td>-25.4242957772</td>\n",
       "      <td>-49.274190974187</td>\n",
       "      <td>1.800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>180641</td>\n",
       "      <td>Av. Iguacu, 3064 - Agua Verde</td>\n",
       "      <td>-25.450067365812</td>\n",
       "      <td>-49.290571839756</td>\n",
       "      <td>1.798742</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>180640</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 3605 - Agua Verde</td>\n",
       "      <td>-25.453362226006</td>\n",
       "      <td>-49.293697954363</td>\n",
       "      <td>1.793893</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>150005</td>\n",
       "      <td>Av. Pres. Kennedy, 700 - Reboucas</td>\n",
       "      <td>-25.45518</td>\n",
       "      <td>-49.26739</td>\n",
       "      <td>1.789062</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>150004</td>\n",
       "      <td>Av. Pres. Kennedy, 601 - Reboucas</td>\n",
       "      <td>-25.45503</td>\n",
       "      <td>-49.26686</td>\n",
       "      <td>1.777778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>180534</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 3355 - Agua Verde</td>\n",
       "      <td>-25.452466133913</td>\n",
       "      <td>-49.291257144159</td>\n",
       "      <td>1.750000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>110120</td>\n",
       "      <td>Av. Candido de Abreu, 707 - Centro Civico</td>\n",
       "      <td>-25.418154239854</td>\n",
       "      <td>-49.268749999896</td>\n",
       "      <td>1.748428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>180076</td>\n",
       "      <td>Rua Pedro Gusso, 4216 - Cidade Industrial</td>\n",
       "      <td>-25.512565941394</td>\n",
       "      <td>-49.330332507546</td>\n",
       "      <td>1.745223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>103155</td>\n",
       "      <td>Av. Candido de Abreu, 51  - Centro Civico</td>\n",
       "      <td>-25.423600052884</td>\n",
       "      <td>-49.270048917478</td>\n",
       "      <td>1.742188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>110060</td>\n",
       "      <td>R. Des. Westphalen, 922 - Centro</td>\n",
       "      <td>-25.440644903696</td>\n",
       "      <td>-49.269306466922</td>\n",
       "      <td>1.741935</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>110142</td>\n",
       "      <td>Rua dos Presbiteros, 49 - S?o Francisco</td>\n",
       "      <td>-25.425330236089</td>\n",
       "      <td>-49.279466041144</td>\n",
       "      <td>1.717514</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>190448</td>\n",
       "      <td>Av. Manoel Ribas, 1363 - Merces</td>\n",
       "      <td>-25.419102734923</td>\n",
       "      <td>-49.293355392273</td>\n",
       "      <td>1.713483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>110033</td>\n",
       "      <td>Av. Manoel Ribas, 530 - Merces</td>\n",
       "      <td>-25.422354282858</td>\n",
       "      <td>-49.284145743551</td>\n",
       "      <td>1.710692</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>110201</td>\n",
       "      <td>Rua Inacio Lustosa, 434 - S?o Francisco</td>\n",
       "      <td>-25.423648628482</td>\n",
       "      <td>-49.273810148865</td>\n",
       "      <td>1.703297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>180637</td>\n",
       "      <td>Avenida Presidente Getulio Vargas, 4557 - Reboucas</td>\n",
       "      <td>-25.456753389811</td>\n",
       "      <td>-49.302464754528</td>\n",
       "      <td>1.700855</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>110187</td>\n",
       "      <td>Rua Treze de Maio, 503 - S?o Francisco</td>\n",
       "      <td>-25.426928549988</td>\n",
       "      <td>-49.271383145224</td>\n",
       "      <td>1.700730</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>190449</td>\n",
       "      <td>Av. Manoel Ribas, 1414 - Merces</td>\n",
       "      <td>-25.41851284247</td>\n",
       "      <td>-49.293422447499</td>\n",
       "      <td>1.694118</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>190240</td>\n",
       "      <td>Rua Via Veneto, 1590 - Santa Felicidade</td>\n",
       "      <td>-25.399830897789</td>\n",
       "      <td>-49.333186317613</td>\n",
       "      <td>1.683544</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>110151</td>\n",
       "      <td>Rua Jaime Reis, 342 - S?o Francisco</td>\n",
       "      <td>-25.426368933248</td>\n",
       "      <td>-49.277005048116</td>\n",
       "      <td>1.679739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>110121</td>\n",
       "      <td>Av. Candido de Abreu, 501 - Centro Civico</td>\n",
       "      <td>-25.419969941954</td>\n",
       "      <td>-49.269177812233</td>\n",
       "      <td>1.678261</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>150637</td>\n",
       "      <td>Av. Pres. Getulio Vargas, 1957 - Reboucas</td>\n",
       "      <td>-25.447492829042</td>\n",
       "      <td>-49.278394610828</td>\n",
       "      <td>1.677778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>140376</td>\n",
       "      <td>Rua Leonardo Novicki, 8 - Cajuru</td>\n",
       "      <td>-25.467446676849</td>\n",
       "      <td>-49.198470669002</td>\n",
       "      <td>1.673469</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   busstop_number                                                  name  \\\n",
       "0   150332         Rua Leon Nicolas, 2081 - Cap?o Raso                    \n",
       "1   150331         Av. Winston Churchill, 2472 - Cap?o Raso               \n",
       "2   150751         Av. Winston Churchill, 2677 - Cap?o Raso               \n",
       "3   110022         Rua Vinte e Quatro de Maio, 280-350 - Centro           \n",
       "4   160244         Rua Emanoel Voluz, 284 - Pinheirinho                   \n",
       "5   110024         Rua Alferes Poli, 787 - Reboucas                       \n",
       "6   150634         Av. Iguacu, 2612 - Agua Verde                          \n",
       "7   110026         Rua Alferes Poli, 400 - Reboucas                       \n",
       "8   150631         Av. Iguacu, 1788 - Agua Verde                          \n",
       "9   110208         Av. Iguacu, 1184 - Reboucas                            \n",
       "10  150330         Av. Winston Churchill, 2546 - Cap?o Raso               \n",
       "11  160245         Rua Mal. Otavio Saldanha Maza, 3046 - Cap?o Raso       \n",
       "12  110211         Av. Pres. Getulio Vargas, 1309 - Reboucas              \n",
       "13  140228         Rua Engenheiro Benedito Mario da Silva, 570 - Cajuru   \n",
       "14  150635         Av. Pres. Getulio Vargas, 2676 - Agua Verde            \n",
       "15  110210         Av. Pres. Getulio Vargas, 1708 - Reboucas              \n",
       "16  110122         Rua Bar?o do Serro Azul, 217 - S?o Francisco           \n",
       "17  170051         Rua Joaquim Sim?es, 10 - Pinheirinho                   \n",
       "18  110126         Rua Heitor S de Franca, 93 - Centro Civico             \n",
       "19  150169         Rua Clara Polsin, 140 - Novo Mundo                     \n",
       "20  150636         Av. Pres. Getulio Vargas, 2349 - Agua Verde            \n",
       "21  180535         Av. Pres. Getulio Vargas, 3047 - Agua Verde            \n",
       "22  110037         Av. Manoel Ribas, 531 - Merces                         \n",
       "23  180074         Rua Pedro Gusso, 4150 - Cidade Industrial              \n",
       "24  110209         Av. Iguacu, 1438 - Reboucas                            \n",
       "25  170121         Rodovia BR476 - Pista Lateral, 20916 - Pinheirinho     \n",
       "26  150633         Av. Iguacu, 2436 - Agua Verde                          \n",
       "27  140375         Rua Leonardo Novicki, 8 - Cajuru                       \n",
       "28  110133         Rua Trajano Reis, 296 - S?o Francisco                  \n",
       "29  180641         Av. Iguacu, 3064 - Agua Verde                          \n",
       "30  180640         Av. Pres. Getulio Vargas, 3605 - Agua Verde            \n",
       "31  150005         Av. Pres. Kennedy, 700 - Reboucas                      \n",
       "32  150004         Av. Pres. Kennedy, 601 - Reboucas                      \n",
       "33  180534         Av. Pres. Getulio Vargas, 3355 - Agua Verde            \n",
       "34  110120         Av. Candido de Abreu, 707 - Centro Civico              \n",
       "35  180076         Rua Pedro Gusso, 4216 - Cidade Industrial              \n",
       "36  103155         Av. Candido de Abreu, 51  - Centro Civico              \n",
       "37  110060         R. Des. Westphalen, 922 - Centro                       \n",
       "38  110142         Rua dos Presbiteros, 49 - S?o Francisco                \n",
       "39  190448         Av. Manoel Ribas, 1363 - Merces                        \n",
       "40  110033         Av. Manoel Ribas, 530 - Merces                         \n",
       "41  110201         Rua Inacio Lustosa, 434 - S?o Francisco                \n",
       "42  180637         Avenida Presidente Getulio Vargas, 4557 - Reboucas     \n",
       "43  110187         Rua Treze de Maio, 503 - S?o Francisco                 \n",
       "44  190449         Av. Manoel Ribas, 1414 - Merces                        \n",
       "45  190240         Rua Via Veneto, 1590 - Santa Felicidade                \n",
       "46  110151         Rua Jaime Reis, 342 - S?o Francisco                    \n",
       "47  110121         Av. Candido de Abreu, 501 - Centro Civico              \n",
       "48  150637         Av. Pres. Getulio Vargas, 1957 - Reboucas              \n",
       "49  140376         Rua Leonardo Novicki, 8 - Cajuru                       \n",
       "\n",
       "            latitude         longitude  nr_medio_linhas  \n",
       "0   -25.515159644727  -49.294443608469  2.971014         \n",
       "1   -25.518348864079  -49.29566769888   2.827778         \n",
       "2   -25.520731874323  -49.295383384725  2.748768         \n",
       "3   -25.439756734365  -49.273240017786  2.531792         \n",
       "4   -25.524017075104  -49.292992119479  2.360825         \n",
       "5   -25.443478176732  -49.270140950921  2.301887         \n",
       "6   -25.448942375096  -49.287531555838  2.296296         \n",
       "7   -25.440705808683  -49.271456482887  2.288462         \n",
       "8   -25.445710238874  -49.278719158119  2.242857         \n",
       "9   -25.443296676303  -49.272462905592  2.242718         \n",
       "10  -25.519229941942  -49.295454463264  2.188811         \n",
       "11  -25.525816036122  -49.293896099826  2.182857         \n",
       "12  -25.445197981519  -49.272273809856  2.156627         \n",
       "13  -25.46962         -49.20589         2.091549         \n",
       "14  -25.449985020239  -49.284862757868  2.079268         \n",
       "15  -25.446516767314  -49.27578884477   2.056250         \n",
       "16  -25.427695151901  -49.271025854244  2.046667         \n",
       "17  -25.52114093887   -49.296043208143  2.016304         \n",
       "18  -25.423318109898  -49.268572186508  1.993827         \n",
       "19  -25.491665473459  -49.288603003058  1.982036         \n",
       "20  -25.448776471378  -49.281718062548  1.920000         \n",
       "21  -25.45146710446   -49.288747937626  1.901515         \n",
       "22  -25.422482678274  -49.284327553297  1.876543         \n",
       "23  -25.511476635367  -49.328306098635  1.858824         \n",
       "24  -25.444475004665  -49.275511236137  1.853211         \n",
       "25  -25.53378939418   -49.301047795606  1.832370         \n",
       "26  -25.447883978109  -49.284622700161  1.816327         \n",
       "27  -25.467723882337  -49.19849188643   1.815476         \n",
       "28  -25.4242957772    -49.274190974187  1.800000         \n",
       "29  -25.450067365812  -49.290571839756  1.798742         \n",
       "30  -25.453362226006  -49.293697954363  1.793893         \n",
       "31  -25.45518         -49.26739         1.789062         \n",
       "32  -25.45503         -49.26686         1.777778         \n",
       "33  -25.452466133913  -49.291257144159  1.750000         \n",
       "34  -25.418154239854  -49.268749999896  1.748428         \n",
       "35  -25.512565941394  -49.330332507546  1.745223         \n",
       "36  -25.423600052884  -49.270048917478  1.742188         \n",
       "37  -25.440644903696  -49.269306466922  1.741935         \n",
       "38  -25.425330236089  -49.279466041144  1.717514         \n",
       "39  -25.419102734923  -49.293355392273  1.713483         \n",
       "40  -25.422354282858  -49.284145743551  1.710692         \n",
       "41  -25.423648628482  -49.273810148865  1.703297         \n",
       "42  -25.456753389811  -49.302464754528  1.700855         \n",
       "43  -25.426928549988  -49.271383145224  1.700730         \n",
       "44  -25.41851284247   -49.293422447499  1.694118         \n",
       "45  -25.399830897789  -49.333186317613  1.683544         \n",
       "46  -25.426368933248  -49.277005048116  1.679739         \n",
       "47  -25.419969941954  -49.269177812233  1.678261         \n",
       "48  -25.447492829042  -49.278394610828  1.677778         \n",
       "49  -25.467446676849  -49.198470669002  1.673469         "
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
